analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
/**
 * @file    i3c_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the I3C Peripheral Module.
 * @note    This file is @generated.
 * @ingroup i3c_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2024 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_I3C_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_I3C_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     i3c
 * @defgroup    i3c_registers I3C_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the I3C Peripheral Module.
 * @details     Improved Inter-Integrated Circuit.
 */

/**
 * @ingroup i3c_registers
 * Structure type to access the I3C Registers.
 */
typedef struct {
    __IO uint32_t cont_ctrl0;           /**< <tt>\b 0x000:</tt> I3C CONT_CTRL0 Register */
    __IO uint32_t targ_ctrl0;           /**< <tt>\b 0x004:</tt> I3C TARG_CTRL0 Register */
    __IO uint32_t targ_status;          /**< <tt>\b 0x008:</tt> I3C TARG_STATUS Register */
    __IO uint32_t targ_ctrl1;           /**< <tt>\b 0x00C:</tt> I3C TARG_CTRL1 Register */
    __IO uint32_t targ_inten;           /**< <tt>\b 0x010:</tt> I3C TARG_INTEN Register */
    __O  uint32_t targ_intclr;          /**< <tt>\b 0x014:</tt> I3C TARG_INTCLR Register */
    __I  uint32_t targ_intfl;           /**< <tt>\b 0x018:</tt> I3C TARG_INTFL Register */
    __IO uint32_t targ_errwarn;         /**< <tt>\b 0x01C:</tt> I3C TARG_ERRWARN Register */
    __IO uint32_t targ_dmactrl;         /**< <tt>\b 0x020:</tt> I3C TARG_DMACTRL Register */
    __R  uint32_t rsv_0x24_0x2b[2];
    __IO uint32_t targ_fifoctrl;        /**< <tt>\b 0x02C:</tt> I3C TARG_FIFOCTRL Register */
    __O  uint32_t targ_txfifo8;         /**< <tt>\b 0x030:</tt> I3C TARG_TXFIFO8 Register */
    __O  uint32_t targ_txfifo8e;        /**< <tt>\b 0x034:</tt> I3C TARG_TXFIFO8E Register */
    __O  uint32_t targ_txfifo16;        /**< <tt>\b 0x038:</tt> I3C TARG_TXFIFO16 Register */
    __O  uint32_t targ_txfifo16e;       /**< <tt>\b 0x03C:</tt> I3C TARG_TXFIFO16E Register */
    __I  uint32_t targ_rxfifo8;         /**< <tt>\b 0x040:</tt> I3C TARG_RXFIFO8 Register */
    __R  uint32_t rsv_0x44;
    __I  uint32_t targ_rxfifo16;        /**< <tt>\b 0x048:</tt> I3C TARG_RXFIFO16 Register */
    __R  uint32_t rsv_0x4c_0x53[2];
    __O  uint32_t targ_txfifo8o;        /**< <tt>\b 0x054:</tt> I3C TARG_TXFIFO8O Register */
    __R  uint32_t rsv_0x58;
    __I  uint32_t targ_cap0;            /**< <tt>\b 0x05C:</tt> I3C TARG_CAP0 Register */
    __I  uint32_t targ_cap1;            /**< <tt>\b 0x060:</tt> I3C TARG_CAP1 Register */
    __IO uint32_t targ_dynaddr;         /**< <tt>\b 0x064:</tt> I3C TARG_DYNADDR Register */
    __IO uint32_t targ_maxlimits;       /**< <tt>\b 0x068:</tt> I3C TARG_MAXLIMITS Register */
    __R  uint32_t rsv_0x6c;
    __IO uint32_t targ_idext;           /**< <tt>\b 0x070:</tt> I3C TARG_IDEXT Register */
    __R  uint32_t rsv_0x74_0x7b[2];
    __I  uint32_t targ_msglast;         /**< <tt>\b 0x07C:</tt> I3C TARG_MSGLAST Register */
    __R  uint32_t rsv_0x80;
    __IO uint32_t cont_ctrl1;           /**< <tt>\b 0x084:</tt> I3C CONT_CTRL1 Register */
    __IO uint32_t cont_status;          /**< <tt>\b 0x088:</tt> I3C CONT_STATUS Register */
    __IO uint32_t cont_ibirules;        /**< <tt>\b 0x08C:</tt> I3C CONT_IBIRULES Register */
    __IO uint32_t cont_inten;           /**< <tt>\b 0x090:</tt> I3C CONT_INTEN Register */
    __O  uint32_t cont_intclr;          /**< <tt>\b 0x094:</tt> I3C CONT_INTCLR Register */
    __I  uint32_t cont_intfl;           /**< <tt>\b 0x098:</tt> I3C CONT_INTFL Register */
    __IO uint32_t cont_errwarn;         /**< <tt>\b 0x09C:</tt> I3C CONT_ERRWARN Register */
    __IO uint32_t cont_dmactrl;         /**< <tt>\b 0x0A0:</tt> I3C CONT_DMACTRL Register */
    __R  uint32_t rsv_0xa4_0xab[2];
    __IO uint32_t cont_fifoctrl;        /**< <tt>\b 0x0AC:</tt> I3C CONT_FIFOCTRL Register */
    __O  uint32_t cont_txfifo8;         /**< <tt>\b 0x0B0:</tt> I3C CONT_TXFIFO8 Register */
    __O  uint32_t cont_txfifo8e;        /**< <tt>\b 0x0B4:</tt> I3C CONT_TXFIFO8E Register */
    __O  uint32_t cont_txfifo16;        /**< <tt>\b 0x0B8:</tt> I3C CONT_TXFIFO16 Register */
    __O  uint32_t cont_txfifo16e;       /**< <tt>\b 0x0BC:</tt> I3C CONT_TXFIFO16E Register */
    __I  uint32_t cont_rxfifo8;         /**< <tt>\b 0x0C0:</tt> I3C CONT_RXFIFO8 Register */
    __R  uint32_t rsv_0xc4;
    __I  uint32_t cont_rxfifo16;        /**< <tt>\b 0x0C8:</tt> I3C CONT_RXFIFO16 Register */
    __O  uint32_t cont_txfifo8o;        /**< <tt>\b 0x0CC:</tt> I3C CONT_TXFIFO8O Register */
    union {
        __IO uint32_t cont_txsdrmsg_ctrl; /**< <tt>\b 0x0D0:</tt> I3C CONT_TXSDRMSG_CTRL Register */
        __O  uint32_t cont_txsdrmsg_fifo; /**< <tt>\b 0x0D0:</tt> I3C CONT_TXSDRMSG_FIFO Register */
    };
    __I  uint32_t cont_rxsdrmsg;        /**< <tt>\b 0x0D4:</tt> I3C CONT_RXSDRMSG Register */
    __O  uint32_t cont_txddrmsg;        /**< <tt>\b 0x0D8:</tt> I3C CONT_TXDDRMSG Register */
    __I  uint32_t cont_rxddr16;         /**< <tt>\b 0x0DC:</tt> I3C CONT_RXDDR16 Register */
    __R  uint32_t rsv_0xe0;
    __IO uint32_t cont_dynaddr;         /**< <tt>\b 0x0E4:</tt> I3C CONT_DYNADDR Register */
    __R  uint32_t rsv_0xe8_0x113[11];
    __I  uint32_t targ_groupdef;        /**< <tt>\b 0x114:</tt> I3C TARG_GROUPDEF Register */
    __R  uint32_t rsv_0x118;
    __IO uint32_t targ_mapctrl0;        /**< <tt>\b 0x11C:</tt> I3C TARG_MAPCTRL0 Register */
    __IO uint32_t targ_mapctrl1;        /**< <tt>\b 0x120:</tt> I3C TARG_MAPCTRL1 Register */
    __IO uint32_t targ_mapctrl2;        /**< <tt>\b 0x124:</tt> I3C TARG_MAPCTRL2 Register */
} mxc_i3c_regs_t;

/* Register offsets for module I3C */
/**
 * @ingroup    i3c_registers
 * @defgroup   I3C_Register_Offsets Register Offsets
 * @brief      I3C Peripheral Register Offsets from the I3C Base Peripheral Address.
 * @{
 */
#define MXC_R_I3C_CONT_CTRL0               ((uint32_t)0x00000000UL) /**< Offset from I3C Base Address: <tt> 0x0000</tt> */
#define MXC_R_I3C_TARG_CTRL0               ((uint32_t)0x00000004UL) /**< Offset from I3C Base Address: <tt> 0x0004</tt> */
#define MXC_R_I3C_TARG_STATUS              ((uint32_t)0x00000008UL) /**< Offset from I3C Base Address: <tt> 0x0008</tt> */
#define MXC_R_I3C_TARG_CTRL1               ((uint32_t)0x0000000CUL) /**< Offset from I3C Base Address: <tt> 0x000C</tt> */
#define MXC_R_I3C_TARG_INTEN               ((uint32_t)0x00000010UL) /**< Offset from I3C Base Address: <tt> 0x0010</tt> */
#define MXC_R_I3C_TARG_INTCLR              ((uint32_t)0x00000014UL) /**< Offset from I3C Base Address: <tt> 0x0014</tt> */
#define MXC_R_I3C_TARG_INTFL               ((uint32_t)0x00000018UL) /**< Offset from I3C Base Address: <tt> 0x0018</tt> */
#define MXC_R_I3C_TARG_ERRWARN             ((uint32_t)0x0000001CUL) /**< Offset from I3C Base Address: <tt> 0x001C</tt> */
#define MXC_R_I3C_TARG_DMACTRL             ((uint32_t)0x00000020UL) /**< Offset from I3C Base Address: <tt> 0x0020</tt> */
#define MXC_R_I3C_TARG_FIFOCTRL            ((uint32_t)0x0000002CUL) /**< Offset from I3C Base Address: <tt> 0x002C</tt> */
#define MXC_R_I3C_TARG_TXFIFO8             ((uint32_t)0x00000030UL) /**< Offset from I3C Base Address: <tt> 0x0030</tt> */
#define MXC_R_I3C_TARG_TXFIFO8E            ((uint32_t)0x00000034UL) /**< Offset from I3C Base Address: <tt> 0x0034</tt> */
#define MXC_R_I3C_TARG_TXFIFO16            ((uint32_t)0x00000038UL) /**< Offset from I3C Base Address: <tt> 0x0038</tt> */
#define MXC_R_I3C_TARG_TXFIFO16E           ((uint32_t)0x0000003CUL) /**< Offset from I3C Base Address: <tt> 0x003C</tt> */
#define MXC_R_I3C_TARG_RXFIFO8             ((uint32_t)0x00000040UL) /**< Offset from I3C Base Address: <tt> 0x0040</tt> */
#define MXC_R_I3C_TARG_RXFIFO16            ((uint32_t)0x00000048UL) /**< Offset from I3C Base Address: <tt> 0x0048</tt> */
#define MXC_R_I3C_TARG_TXFIFO8O            ((uint32_t)0x00000054UL) /**< Offset from I3C Base Address: <tt> 0x0054</tt> */
#define MXC_R_I3C_TARG_CAP0                ((uint32_t)0x0000005CUL) /**< Offset from I3C Base Address: <tt> 0x005C</tt> */
#define MXC_R_I3C_TARG_CAP1                ((uint32_t)0x00000060UL) /**< Offset from I3C Base Address: <tt> 0x0060</tt> */
#define MXC_R_I3C_TARG_DYNADDR             ((uint32_t)0x00000064UL) /**< Offset from I3C Base Address: <tt> 0x0064</tt> */
#define MXC_R_I3C_TARG_MAXLIMITS           ((uint32_t)0x00000068UL) /**< Offset from I3C Base Address: <tt> 0x0068</tt> */
#define MXC_R_I3C_TARG_IDEXT               ((uint32_t)0x00000070UL) /**< Offset from I3C Base Address: <tt> 0x0070</tt> */
#define MXC_R_I3C_TARG_MSGLAST             ((uint32_t)0x0000007CUL) /**< Offset from I3C Base Address: <tt> 0x007C</tt> */
#define MXC_R_I3C_CONT_CTRL1               ((uint32_t)0x00000084UL) /**< Offset from I3C Base Address: <tt> 0x0084</tt> */
#define MXC_R_I3C_CONT_STATUS              ((uint32_t)0x00000088UL) /**< Offset from I3C Base Address: <tt> 0x0088</tt> */
#define MXC_R_I3C_CONT_IBIRULES            ((uint32_t)0x0000008CUL) /**< Offset from I3C Base Address: <tt> 0x008C</tt> */
#define MXC_R_I3C_CONT_INTEN               ((uint32_t)0x00000090UL) /**< Offset from I3C Base Address: <tt> 0x0090</tt> */
#define MXC_R_I3C_CONT_INTCLR              ((uint32_t)0x00000094UL) /**< Offset from I3C Base Address: <tt> 0x0094</tt> */
#define MXC_R_I3C_CONT_INTFL               ((uint32_t)0x00000098UL) /**< Offset from I3C Base Address: <tt> 0x0098</tt> */
#define MXC_R_I3C_CONT_ERRWARN             ((uint32_t)0x0000009CUL) /**< Offset from I3C Base Address: <tt> 0x009C</tt> */
#define MXC_R_I3C_CONT_DMACTRL             ((uint32_t)0x000000A0UL) /**< Offset from I3C Base Address: <tt> 0x00A0</tt> */
#define MXC_R_I3C_CONT_FIFOCTRL            ((uint32_t)0x000000ACUL) /**< Offset from I3C Base Address: <tt> 0x00AC</tt> */
#define MXC_R_I3C_CONT_TXFIFO8             ((uint32_t)0x000000B0UL) /**< Offset from I3C Base Address: <tt> 0x00B0</tt> */
#define MXC_R_I3C_CONT_TXFIFO8E            ((uint32_t)0x000000B4UL) /**< Offset from I3C Base Address: <tt> 0x00B4</tt> */
#define MXC_R_I3C_CONT_TXFIFO16            ((uint32_t)0x000000B8UL) /**< Offset from I3C Base Address: <tt> 0x00B8</tt> */
#define MXC_R_I3C_CONT_TXFIFO16E           ((uint32_t)0x000000BCUL) /**< Offset from I3C Base Address: <tt> 0x00BC</tt> */
#define MXC_R_I3C_CONT_RXFIFO8             ((uint32_t)0x000000C0UL) /**< Offset from I3C Base Address: <tt> 0x00C0</tt> */
#define MXC_R_I3C_CONT_RXFIFO16            ((uint32_t)0x000000C8UL) /**< Offset from I3C Base Address: <tt> 0x00C8</tt> */
#define MXC_R_I3C_CONT_TXFIFO8O            ((uint32_t)0x000000CCUL) /**< Offset from I3C Base Address: <tt> 0x00CC</tt> */
#define MXC_R_I3C_CONT_TXSDRMSG_CTRL       ((uint32_t)0x000000D0UL) /**< Offset from I3C Base Address: <tt> 0x00D0</tt> */
#define MXC_R_I3C_CONT_TXSDRMSG_FIFO       ((uint32_t)0x000000D0UL) /**< Offset from I3C Base Address: <tt> 0x00D0</tt> */
#define MXC_R_I3C_CONT_RXSDRMSG            ((uint32_t)0x000000D4UL) /**< Offset from I3C Base Address: <tt> 0x00D4</tt> */
#define MXC_R_I3C_CONT_TXDDRMSG            ((uint32_t)0x000000D8UL) /**< Offset from I3C Base Address: <tt> 0x00D8</tt> */
#define MXC_R_I3C_CONT_RXDDR16             ((uint32_t)0x000000DCUL) /**< Offset from I3C Base Address: <tt> 0x00DC</tt> */
#define MXC_R_I3C_CONT_DYNADDR             ((uint32_t)0x000000E4UL) /**< Offset from I3C Base Address: <tt> 0x00E4</tt> */
#define MXC_R_I3C_TARG_GROUPDEF            ((uint32_t)0x00000114UL) /**< Offset from I3C Base Address: <tt> 0x0114</tt> */
#define MXC_R_I3C_TARG_MAPCTRL0            ((uint32_t)0x0000011CUL) /**< Offset from I3C Base Address: <tt> 0x011C</tt> */
#define MXC_R_I3C_TARG_MAPCTRL1            ((uint32_t)0x00000120UL) /**< Offset from I3C Base Address: <tt> 0x0120</tt> */
#define MXC_R_I3C_TARG_MAPCTRL2            ((uint32_t)0x00000124UL) /**< Offset from I3C Base Address: <tt> 0x0124</tt> */
/**@} end of group i3c_registers */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_CTRL0 I3C_CONT_CTRL0
 * @brief    Controller Control 0 (Configuration) Register.
 * @{
 */
#define MXC_F_I3C_CONT_CTRL0_EN_POS                    0 /**< CONT_CTRL0_EN Position */
#define MXC_F_I3C_CONT_CTRL0_EN                        ((uint32_t)(0x3UL << MXC_F_I3C_CONT_CTRL0_EN_POS)) /**< CONT_CTRL0_EN Mask */
#define MXC_V_I3C_CONT_CTRL0_EN_OFF                    ((uint32_t)0x0UL) /**< CONT_CTRL0_EN_OFF Value */
#define MXC_S_I3C_CONT_CTRL0_EN_OFF                    (MXC_V_I3C_CONT_CTRL0_EN_OFF << MXC_F_I3C_CONT_CTRL0_EN_POS) /**< CONT_CTRL0_EN_OFF Setting */
#define MXC_V_I3C_CONT_CTRL0_EN_ON                     ((uint32_t)0x1UL) /**< CONT_CTRL0_EN_ON Value */
#define MXC_S_I3C_CONT_CTRL0_EN_ON                     (MXC_V_I3C_CONT_CTRL0_EN_ON << MXC_F_I3C_CONT_CTRL0_EN_POS) /**< CONT_CTRL0_EN_ON Setting */
#define MXC_V_I3C_CONT_CTRL0_EN_CAP                    ((uint32_t)0x2UL) /**< CONT_CTRL0_EN_CAP Value */
#define MXC_S_I3C_CONT_CTRL0_EN_CAP                    (MXC_V_I3C_CONT_CTRL0_EN_CAP << MXC_F_I3C_CONT_CTRL0_EN_POS) /**< CONT_CTRL0_EN_CAP Setting */

