analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_CONT_CTRL0_TO_DIS_POS                3 /**< CONT_CTRL0_TO_DIS Position */
#define MXC_F_I3C_CONT_CTRL0_TO_DIS                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_CTRL0_TO_DIS_POS)) /**< CONT_CTRL0_TO_DIS Mask */

#define MXC_F_I3C_CONT_CTRL0_HKEEP_POS                 4 /**< CONT_CTRL0_HKEEP Position */
#define MXC_F_I3C_CONT_CTRL0_HKEEP                     ((uint32_t)(0x3UL << MXC_F_I3C_CONT_CTRL0_HKEEP_POS)) /**< CONT_CTRL0_HKEEP Mask */
#define MXC_V_I3C_CONT_CTRL0_HKEEP_OFF                 ((uint32_t)0x0UL) /**< CONT_CTRL0_HKEEP_OFF Value */
#define MXC_S_I3C_CONT_CTRL0_HKEEP_OFF                 (MXC_V_I3C_CONT_CTRL0_HKEEP_OFF << MXC_F_I3C_CONT_CTRL0_HKEEP_POS) /**< CONT_CTRL0_HKEEP_OFF Setting */
#define MXC_V_I3C_CONT_CTRL0_HKEEP_ON_CHIP             ((uint32_t)0x1UL) /**< CONT_CTRL0_HKEEP_ON_CHIP Value */
#define MXC_S_I3C_CONT_CTRL0_HKEEP_ON_CHIP             (MXC_V_I3C_CONT_CTRL0_HKEEP_ON_CHIP << MXC_F_I3C_CONT_CTRL0_HKEEP_POS) /**< CONT_CTRL0_HKEEP_ON_CHIP Setting */
#define MXC_V_I3C_CONT_CTRL0_HKEEP_EXT_SDA             ((uint32_t)0x2UL) /**< CONT_CTRL0_HKEEP_EXT_SDA Value */
#define MXC_S_I3C_CONT_CTRL0_HKEEP_EXT_SDA             (MXC_V_I3C_CONT_CTRL0_HKEEP_EXT_SDA << MXC_F_I3C_CONT_CTRL0_HKEEP_POS) /**< CONT_CTRL0_HKEEP_EXT_SDA Setting */
#define MXC_V_I3C_CONT_CTRL0_HKEEP_EXT_SCL_SDA         ((uint32_t)0x3UL) /**< CONT_CTRL0_HKEEP_EXT_SCL_SDA Value */
#define MXC_S_I3C_CONT_CTRL0_HKEEP_EXT_SCL_SDA         (MXC_V_I3C_CONT_CTRL0_HKEEP_EXT_SCL_SDA << MXC_F_I3C_CONT_CTRL0_HKEEP_POS) /**< CONT_CTRL0_HKEEP_EXT_SCL_SDA Setting */

#define MXC_F_I3C_CONT_CTRL0_OD_STOP_POS               6 /**< CONT_CTRL0_OD_STOP Position */
#define MXC_F_I3C_CONT_CTRL0_OD_STOP                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_CTRL0_OD_STOP_POS)) /**< CONT_CTRL0_OD_STOP Mask */

#define MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS               8 /**< CONT_CTRL0_PP_BAUD Position */
#define MXC_F_I3C_CONT_CTRL0_PP_BAUD                   ((uint32_t)(0xFUL << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS)) /**< CONT_CTRL0_PP_BAUD Mask */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_1_FCLK            ((uint32_t)0x0UL) /**< CONT_CTRL0_PP_BAUD_1_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_1_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_1_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_1_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_2_FCLK            ((uint32_t)0x1UL) /**< CONT_CTRL0_PP_BAUD_2_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_2_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_2_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_2_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_3_FCLK            ((uint32_t)0x2UL) /**< CONT_CTRL0_PP_BAUD_3_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_3_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_3_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_3_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_4_FCLK            ((uint32_t)0x3UL) /**< CONT_CTRL0_PP_BAUD_4_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_4_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_4_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_4_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_5_FCLK            ((uint32_t)0x4UL) /**< CONT_CTRL0_PP_BAUD_5_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_5_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_5_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_5_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_6_FCLK            ((uint32_t)0x5UL) /**< CONT_CTRL0_PP_BAUD_6_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_6_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_6_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_6_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_7_FCLK            ((uint32_t)0x6UL) /**< CONT_CTRL0_PP_BAUD_7_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_7_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_7_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_7_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_8_FCLK            ((uint32_t)0x7UL) /**< CONT_CTRL0_PP_BAUD_8_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_8_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_8_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_8_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_9_FCLK            ((uint32_t)0x8UL) /**< CONT_CTRL0_PP_BAUD_9_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_9_FCLK            (MXC_V_I3C_CONT_CTRL0_PP_BAUD_9_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_9_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_10_FCLK           ((uint32_t)0x9UL) /**< CONT_CTRL0_PP_BAUD_10_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_10_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_10_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_10_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_11_FCLK           ((uint32_t)0xAUL) /**< CONT_CTRL0_PP_BAUD_11_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_11_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_11_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_11_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_12_FCLK           ((uint32_t)0xBUL) /**< CONT_CTRL0_PP_BAUD_12_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_12_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_12_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_12_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_13_FCLK           ((uint32_t)0xCUL) /**< CONT_CTRL0_PP_BAUD_13_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_13_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_13_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_13_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_14_FCLK           ((uint32_t)0xDUL) /**< CONT_CTRL0_PP_BAUD_14_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_14_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_14_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_14_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_15_FCLK           ((uint32_t)0xEUL) /**< CONT_CTRL0_PP_BAUD_15_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_15_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_15_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_15_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_BAUD_16_FCLK           ((uint32_t)0xFUL) /**< CONT_CTRL0_PP_BAUD_16_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_BAUD_16_FCLK           (MXC_V_I3C_CONT_CTRL0_PP_BAUD_16_FCLK << MXC_F_I3C_CONT_CTRL0_PP_BAUD_POS) /**< CONT_CTRL0_PP_BAUD_16_FCLK Setting */

#define MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS          12 /**< CONT_CTRL0_PP_ADD_LBAUD Position */
#define MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD              ((uint32_t)(0xFUL << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS)) /**< CONT_CTRL0_PP_ADD_LBAUD Mask */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_0_FCLK       ((uint32_t)0x0UL) /**< CONT_CTRL0_PP_ADD_LBAUD_0_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_0_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_0_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_0_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_1_FCLK       ((uint32_t)0x1UL) /**< CONT_CTRL0_PP_ADD_LBAUD_1_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_1_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_1_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_1_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_2_FCLK       ((uint32_t)0x2UL) /**< CONT_CTRL0_PP_ADD_LBAUD_2_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_2_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_2_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_2_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_3_FCLK       ((uint32_t)0x3UL) /**< CONT_CTRL0_PP_ADD_LBAUD_3_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_3_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_3_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_3_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_4_FCLK       ((uint32_t)0x4UL) /**< CONT_CTRL0_PP_ADD_LBAUD_4_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_4_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_4_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_4_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_5_FCLK       ((uint32_t)0x5UL) /**< CONT_CTRL0_PP_ADD_LBAUD_5_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_5_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_5_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_5_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_6_FCLK       ((uint32_t)0x6UL) /**< CONT_CTRL0_PP_ADD_LBAUD_6_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_6_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_6_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_6_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_7_FCLK       ((uint32_t)0x7UL) /**< CONT_CTRL0_PP_ADD_LBAUD_7_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_7_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_7_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_7_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_8_FCLK       ((uint32_t)0x8UL) /**< CONT_CTRL0_PP_ADD_LBAUD_8_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_8_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_8_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_8_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_9_FCLK       ((uint32_t)0x9UL) /**< CONT_CTRL0_PP_ADD_LBAUD_9_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_9_FCLK       (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_9_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_9_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_10_FCLK      ((uint32_t)0xAUL) /**< CONT_CTRL0_PP_ADD_LBAUD_10_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_10_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_10_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_10_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_11_FCLK      ((uint32_t)0xBUL) /**< CONT_CTRL0_PP_ADD_LBAUD_11_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_11_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_11_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_11_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_12_FCLK      ((uint32_t)0xCUL) /**< CONT_CTRL0_PP_ADD_LBAUD_12_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_12_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_12_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_12_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_13_FCLK      ((uint32_t)0xDUL) /**< CONT_CTRL0_PP_ADD_LBAUD_13_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_13_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_13_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_13_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_14_FCLK      ((uint32_t)0xEUL) /**< CONT_CTRL0_PP_ADD_LBAUD_14_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_14_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_14_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_14_FCLK Setting */
#define MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_15_FCLK      ((uint32_t)0xFUL) /**< CONT_CTRL0_PP_ADD_LBAUD_15_FCLK Value */
#define MXC_S_I3C_CONT_CTRL0_PP_ADD_LBAUD_15_FCLK      (MXC_V_I3C_CONT_CTRL0_PP_ADD_LBAUD_15_FCLK << MXC_F_I3C_CONT_CTRL0_PP_ADD_LBAUD_POS) /**< CONT_CTRL0_PP_ADD_LBAUD_15_FCLK Setting */

#define MXC_F_I3C_CONT_CTRL0_OD_LBAUD_POS              16 /**< CONT_CTRL0_OD_LBAUD Position */
#define MXC_F_I3C_CONT_CTRL0_OD_LBAUD                  ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_CTRL0_OD_LBAUD_POS)) /**< CONT_CTRL0_OD_LBAUD Mask */

#define MXC_F_I3C_CONT_CTRL0_OD_HP_POS                 24 /**< CONT_CTRL0_OD_HP Position */
#define MXC_F_I3C_CONT_CTRL0_OD_HP                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_CTRL0_OD_HP_POS)) /**< CONT_CTRL0_OD_HP Mask */

#define MXC_F_I3C_CONT_CTRL0_PP_SKEW_POS               25 /**< CONT_CTRL0_PP_SKEW Position */
#define MXC_F_I3C_CONT_CTRL0_PP_SKEW                   ((uint32_t)(0x7UL << MXC_F_I3C_CONT_CTRL0_PP_SKEW_POS)) /**< CONT_CTRL0_PP_SKEW Mask */

#define MXC_F_I3C_CONT_CTRL0_I2C_BAUD_POS              28 /**< CONT_CTRL0_I2C_BAUD Position */
#define MXC_F_I3C_CONT_CTRL0_I2C_BAUD                  ((uint32_t)(0xFUL << MXC_F_I3C_CONT_CTRL0_I2C_BAUD_POS)) /**< CONT_CTRL0_I2C_BAUD Mask */

/**@} end of group I3C_CONT_CTRL0_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_CTRL0 I3C_TARG_CTRL0
 * @brief    Target Control 0 (Configuration) Register.
 * @{
 */
#define MXC_F_I3C_TARG_CTRL0_EN_POS                    0 /**< TARG_CTRL0_EN Position */
#define MXC_F_I3C_TARG_CTRL0_EN                        ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CTRL0_EN_POS)) /**< TARG_CTRL0_EN Mask */

#define MXC_F_I3C_TARG_CTRL0_MATCHSS_POS               2 /**< TARG_CTRL0_MATCHSS Position */
#define MXC_F_I3C_TARG_CTRL0_MATCHSS                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CTRL0_MATCHSS_POS)) /**< TARG_CTRL0_MATCHSS Mask */

#define MXC_F_I3C_TARG_CTRL0_TO_IGN_POS                3 /**< TARG_CTRL0_TO_IGN Position */
#define MXC_F_I3C_TARG_CTRL0_TO_IGN                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CTRL0_TO_IGN_POS)) /**< TARG_CTRL0_TO_IGN Mask */

#define MXC_F_I3C_TARG_CTRL0_OFFLINE_POS               9 /**< TARG_CTRL0_OFFLINE Position */
#define MXC_F_I3C_TARG_CTRL0_OFFLINE                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CTRL0_OFFLINE_POS)) /**< TARG_CTRL0_OFFLINE Mask */

/**@} end of group I3C_TARG_CTRL0_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_STATUS I3C_TARG_STATUS
 * @brief    Target Status Register.
 * @{
 */
#define MXC_F_I3C_TARG_STATUS_BUSY_POS                 0 /**< TARG_STATUS_BUSY Position */
#define MXC_F_I3C_TARG_STATUS_BUSY                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_BUSY_POS)) /**< TARG_STATUS_BUSY Mask */

