analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_STATUS_LIST_RESP_POS            1 /**< TARG_STATUS_LIST_RESP Position */
#define MXC_F_I3C_TARG_STATUS_LIST_RESP                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_LIST_RESP_POS)) /**< TARG_STATUS_LIST_RESP Mask */

#define MXC_F_I3C_TARG_STATUS_CCCH_POS                 2 /**< TARG_STATUS_CCCH Position */
#define MXC_F_I3C_TARG_STATUS_CCCH                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_CCCH_POS)) /**< TARG_STATUS_CCCH Mask */

#define MXC_F_I3C_TARG_STATUS_RX_SDR_POS               3 /**< TARG_STATUS_RX_SDR Position */
#define MXC_F_I3C_TARG_STATUS_RX_SDR                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_RX_SDR_POS)) /**< TARG_STATUS_RX_SDR Mask */

#define MXC_F_I3C_TARG_STATUS_TX_SDR_POS               4 /**< TARG_STATUS_TX_SDR Position */
#define MXC_F_I3C_TARG_STATUS_TX_SDR                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_TX_SDR_POS)) /**< TARG_STATUS_TX_SDR Mask */

#define MXC_F_I3C_TARG_STATUS_DAA_POS                  5 /**< TARG_STATUS_DAA Position */
#define MXC_F_I3C_TARG_STATUS_DAA                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_DAA_POS)) /**< TARG_STATUS_DAA Mask */

#define MXC_F_I3C_TARG_STATUS_HDR_POS                  6 /**< TARG_STATUS_HDR Position */
#define MXC_F_I3C_TARG_STATUS_HDR                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_HDR_POS)) /**< TARG_STATUS_HDR Mask */

#define MXC_F_I3C_TARG_STATUS_START_POS                8 /**< TARG_STATUS_START Position */
#define MXC_F_I3C_TARG_STATUS_START                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_START_POS)) /**< TARG_STATUS_START Mask */

#define MXC_F_I3C_TARG_STATUS_ADDRMATCH_POS            9 /**< TARG_STATUS_ADDRMATCH Position */
#define MXC_F_I3C_TARG_STATUS_ADDRMATCH                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_ADDRMATCH_POS)) /**< TARG_STATUS_ADDRMATCH Mask */

#define MXC_F_I3C_TARG_STATUS_STOP_POS                 10 /**< TARG_STATUS_STOP Position */
#define MXC_F_I3C_TARG_STATUS_STOP                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_STOP_POS)) /**< TARG_STATUS_STOP Mask */

#define MXC_F_I3C_TARG_STATUS_RX_RDY_POS               11 /**< TARG_STATUS_RX_RDY Position */
#define MXC_F_I3C_TARG_STATUS_RX_RDY                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_RX_RDY_POS)) /**< TARG_STATUS_RX_RDY Mask */

#define MXC_F_I3C_TARG_STATUS_TX_NFULL_POS             12 /**< TARG_STATUS_TX_NFULL Position */
#define MXC_F_I3C_TARG_STATUS_TX_NFULL                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_TX_NFULL_POS)) /**< TARG_STATUS_TX_NFULL Mask */

#define MXC_F_I3C_TARG_STATUS_DYNADDR_CHG_POS          13 /**< TARG_STATUS_DYNADDR_CHG Position */
#define MXC_F_I3C_TARG_STATUS_DYNADDR_CHG              ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_DYNADDR_CHG_POS)) /**< TARG_STATUS_DYNADDR_CHG Mask */

#define MXC_F_I3C_TARG_STATUS_CCC_POS                  14 /**< TARG_STATUS_CCC Position */
#define MXC_F_I3C_TARG_STATUS_CCC                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_CCC_POS)) /**< TARG_STATUS_CCC Mask */

#define MXC_F_I3C_TARG_STATUS_ERRWARN_POS              15 /**< TARG_STATUS_ERRWARN Position */
#define MXC_F_I3C_TARG_STATUS_ERRWARN                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_ERRWARN_POS)) /**< TARG_STATUS_ERRWARN Mask */

#define MXC_F_I3C_TARG_STATUS_CCCH_DONE_POS            17 /**< TARG_STATUS_CCCH_DONE Position */
#define MXC_F_I3C_TARG_STATUS_CCCH_DONE                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_CCCH_DONE_POS)) /**< TARG_STATUS_CCCH_DONE Mask */

#define MXC_F_I3C_TARG_STATUS_EVENT_REQ_POS            18 /**< TARG_STATUS_EVENT_REQ Position */
#define MXC_F_I3C_TARG_STATUS_EVENT_REQ                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_EVENT_REQ_POS)) /**< TARG_STATUS_EVENT_REQ Mask */

#define MXC_F_I3C_TARG_STATUS_TARG_RST_POS             19 /**< TARG_STATUS_TARG_RST Position */
#define MXC_F_I3C_TARG_STATUS_TARG_RST                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_TARG_RST_POS)) /**< TARG_STATUS_TARG_RST Mask */

#define MXC_F_I3C_TARG_STATUS_EVENT_POS                20 /**< TARG_STATUS_EVENT Position */
#define MXC_F_I3C_TARG_STATUS_EVENT                    ((uint32_t)(0x3UL << MXC_F_I3C_TARG_STATUS_EVENT_POS)) /**< TARG_STATUS_EVENT Mask */
#define MXC_V_I3C_TARG_STATUS_EVENT_NONE               ((uint32_t)0x0UL) /**< TARG_STATUS_EVENT_NONE Value */
#define MXC_S_I3C_TARG_STATUS_EVENT_NONE               (MXC_V_I3C_TARG_STATUS_EVENT_NONE << MXC_F_I3C_TARG_STATUS_EVENT_POS) /**< TARG_STATUS_EVENT_NONE Setting */
#define MXC_V_I3C_TARG_STATUS_EVENT_REQ_PEND           ((uint32_t)0x1UL) /**< TARG_STATUS_EVENT_REQ_PEND Value */
#define MXC_S_I3C_TARG_STATUS_EVENT_REQ_PEND           (MXC_V_I3C_TARG_STATUS_EVENT_REQ_PEND << MXC_F_I3C_TARG_STATUS_EVENT_POS) /**< TARG_STATUS_EVENT_REQ_PEND Setting */
#define MXC_V_I3C_TARG_STATUS_EVENT_REQ_NACK           ((uint32_t)0x2UL) /**< TARG_STATUS_EVENT_REQ_NACK Value */
#define MXC_S_I3C_TARG_STATUS_EVENT_REQ_NACK           (MXC_V_I3C_TARG_STATUS_EVENT_REQ_NACK << MXC_F_I3C_TARG_STATUS_EVENT_POS) /**< TARG_STATUS_EVENT_REQ_NACK Setting */
#define MXC_V_I3C_TARG_STATUS_EVENT_REQ_ACK            ((uint32_t)0x3UL) /**< TARG_STATUS_EVENT_REQ_ACK Value */
#define MXC_S_I3C_TARG_STATUS_EVENT_REQ_ACK            (MXC_V_I3C_TARG_STATUS_EVENT_REQ_ACK << MXC_F_I3C_TARG_STATUS_EVENT_POS) /**< TARG_STATUS_EVENT_REQ_ACK Setting */

#define MXC_F_I3C_TARG_STATUS_IBI_DIS_POS              24 /**< TARG_STATUS_IBI_DIS Position */
#define MXC_F_I3C_TARG_STATUS_IBI_DIS                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_IBI_DIS_POS)) /**< TARG_STATUS_IBI_DIS Mask */

#define MXC_F_I3C_TARG_STATUS_CONTREQ_DIS_POS          25 /**< TARG_STATUS_CONTREQ_DIS Position */
#define MXC_F_I3C_TARG_STATUS_CONTREQ_DIS              ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_CONTREQ_DIS_POS)) /**< TARG_STATUS_CONTREQ_DIS Mask */

#define MXC_F_I3C_TARG_STATUS_HJ_DIS_POS               27 /**< TARG_STATUS_HJ_DIS Position */
#define MXC_F_I3C_TARG_STATUS_HJ_DIS                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_STATUS_HJ_DIS_POS)) /**< TARG_STATUS_HJ_DIS Mask */

