analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_STATUS_ACTSTATE_POS             28 /**< TARG_STATUS_ACTSTATE Position */
#define MXC_F_I3C_TARG_STATUS_ACTSTATE                 ((uint32_t)(0x3UL << MXC_F_I3C_TARG_STATUS_ACTSTATE_POS)) /**< TARG_STATUS_ACTSTATE Mask */
#define MXC_V_I3C_TARG_STATUS_ACTSTATE_NORMAL          ((uint32_t)0x0UL) /**< TARG_STATUS_ACTSTATE_NORMAL Value */
#define MXC_S_I3C_TARG_STATUS_ACTSTATE_NORMAL          (MXC_V_I3C_TARG_STATUS_ACTSTATE_NORMAL << MXC_F_I3C_TARG_STATUS_ACTSTATE_POS) /**< TARG_STATUS_ACTSTATE_NORMAL Setting */
#define MXC_V_I3C_TARG_STATUS_ACTSTATE_1MS_LAT         ((uint32_t)0x1UL) /**< TARG_STATUS_ACTSTATE_1MS_LAT Value */
#define MXC_S_I3C_TARG_STATUS_ACTSTATE_1MS_LAT         (MXC_V_I3C_TARG_STATUS_ACTSTATE_1MS_LAT << MXC_F_I3C_TARG_STATUS_ACTSTATE_POS) /**< TARG_STATUS_ACTSTATE_1MS_LAT Setting */
#define MXC_V_I3C_TARG_STATUS_ACTSTATE_100MS_LAT       ((uint32_t)0x2UL) /**< TARG_STATUS_ACTSTATE_100MS_LAT Value */
#define MXC_S_I3C_TARG_STATUS_ACTSTATE_100MS_LAT       (MXC_V_I3C_TARG_STATUS_ACTSTATE_100MS_LAT << MXC_F_I3C_TARG_STATUS_ACTSTATE_POS) /**< TARG_STATUS_ACTSTATE_100MS_LAT Setting */
#define MXC_V_I3C_TARG_STATUS_ACTSTATE_10S_LAT         ((uint32_t)0x3UL) /**< TARG_STATUS_ACTSTATE_10S_LAT Value */
#define MXC_S_I3C_TARG_STATUS_ACTSTATE_10S_LAT         (MXC_V_I3C_TARG_STATUS_ACTSTATE_10S_LAT << MXC_F_I3C_TARG_STATUS_ACTSTATE_POS) /**< TARG_STATUS_ACTSTATE_10S_LAT Setting */

#define MXC_F_I3C_TARG_STATUS_TIMECTRL_POS             30 /**< TARG_STATUS_TIMECTRL Position */
#define MXC_F_I3C_TARG_STATUS_TIMECTRL                 ((uint32_t)(0x3UL << MXC_F_I3C_TARG_STATUS_TIMECTRL_POS)) /**< TARG_STATUS_TIMECTRL Mask */
#define MXC_V_I3C_TARG_STATUS_TIMECTRL_DIS             ((uint32_t)0x0UL) /**< TARG_STATUS_TIMECTRL_DIS Value */
#define MXC_S_I3C_TARG_STATUS_TIMECTRL_DIS             (MXC_V_I3C_TARG_STATUS_TIMECTRL_DIS << MXC_F_I3C_TARG_STATUS_TIMECTRL_POS) /**< TARG_STATUS_TIMECTRL_DIS Setting */
#define MXC_V_I3C_TARG_STATUS_TIMECTRL_SYNC            ((uint32_t)0x1UL) /**< TARG_STATUS_TIMECTRL_SYNC Value */
#define MXC_S_I3C_TARG_STATUS_TIMECTRL_SYNC            (MXC_V_I3C_TARG_STATUS_TIMECTRL_SYNC << MXC_F_I3C_TARG_STATUS_TIMECTRL_POS) /**< TARG_STATUS_TIMECTRL_SYNC Setting */
#define MXC_V_I3C_TARG_STATUS_TIMECTRL_ASYNC           ((uint32_t)0x2UL) /**< TARG_STATUS_TIMECTRL_ASYNC Value */
#define MXC_S_I3C_TARG_STATUS_TIMECTRL_ASYNC           (MXC_V_I3C_TARG_STATUS_TIMECTRL_ASYNC << MXC_F_I3C_TARG_STATUS_TIMECTRL_POS) /**< TARG_STATUS_TIMECTRL_ASYNC Setting */
#define MXC_V_I3C_TARG_STATUS_TIMECTRL_BOTH            ((uint32_t)0x3UL) /**< TARG_STATUS_TIMECTRL_BOTH Value */
#define MXC_S_I3C_TARG_STATUS_TIMECTRL_BOTH            (MXC_V_I3C_TARG_STATUS_TIMECTRL_BOTH << MXC_F_I3C_TARG_STATUS_TIMECTRL_POS) /**< TARG_STATUS_TIMECTRL_BOTH Setting */

/**@} end of group I3C_TARG_STATUS_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_CTRL1 I3C_TARG_CTRL1
 * @brief    Target Control 1 Register.
 * @{
 */
#define MXC_F_I3C_TARG_CTRL1_EVENT_POS                 0 /**< TARG_CTRL1_EVENT Position */
#define MXC_F_I3C_TARG_CTRL1_EVENT                     ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CTRL1_EVENT_POS)) /**< TARG_CTRL1_EVENT Mask */
#define MXC_V_I3C_TARG_CTRL1_EVENT_NORMAL              ((uint32_t)0x0UL) /**< TARG_CTRL1_EVENT_NORMAL Value */
#define MXC_S_I3C_TARG_CTRL1_EVENT_NORMAL              (MXC_V_I3C_TARG_CTRL1_EVENT_NORMAL << MXC_F_I3C_TARG_CTRL1_EVENT_POS) /**< TARG_CTRL1_EVENT_NORMAL Setting */
#define MXC_V_I3C_TARG_CTRL1_EVENT_IBI                 ((uint32_t)0x1UL) /**< TARG_CTRL1_EVENT_IBI Value */
#define MXC_S_I3C_TARG_CTRL1_EVENT_IBI                 (MXC_V_I3C_TARG_CTRL1_EVENT_IBI << MXC_F_I3C_TARG_CTRL1_EVENT_POS) /**< TARG_CTRL1_EVENT_IBI Setting */
#define MXC_V_I3C_TARG_CTRL1_EVENT_CONTREQ             ((uint32_t)0x2UL) /**< TARG_CTRL1_EVENT_CONTREQ Value */
#define MXC_S_I3C_TARG_CTRL1_EVENT_CONTREQ             (MXC_V_I3C_TARG_CTRL1_EVENT_CONTREQ << MXC_F_I3C_TARG_CTRL1_EVENT_POS) /**< TARG_CTRL1_EVENT_CONTREQ Setting */
#define MXC_V_I3C_TARG_CTRL1_EVENT_HJ                  ((uint32_t)0x3UL) /**< TARG_CTRL1_EVENT_HJ Value */
#define MXC_S_I3C_TARG_CTRL1_EVENT_HJ                  (MXC_V_I3C_TARG_CTRL1_EVENT_HJ << MXC_F_I3C_TARG_CTRL1_EVENT_POS) /**< TARG_CTRL1_EVENT_HJ Setting */

#define MXC_F_I3C_TARG_CTRL1_EXTIBI_POS                3 /**< TARG_CTRL1_EXTIBI Position */
#define MXC_F_I3C_TARG_CTRL1_EXTIBI                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CTRL1_EXTIBI_POS)) /**< TARG_CTRL1_EXTIBI Mask */

#define MXC_F_I3C_TARG_CTRL1_DYNADDR_IDX_POS           4 /**< TARG_CTRL1_DYNADDR_IDX Position */
#define MXC_F_I3C_TARG_CTRL1_DYNADDR_IDX               ((uint32_t)(0xFUL << MXC_F_I3C_TARG_CTRL1_DYNADDR_IDX_POS)) /**< TARG_CTRL1_DYNADDR_IDX Mask */

#define MXC_F_I3C_TARG_CTRL1_IBIDATA_POS               8 /**< TARG_CTRL1_IBIDATA Position */
#define MXC_F_I3C_TARG_CTRL1_IBIDATA                   ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_CTRL1_IBIDATA_POS)) /**< TARG_CTRL1_IBIDATA Mask */

/**@} end of group I3C_TARG_CTRL1_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_INTEN I3C_TARG_INTEN
 * @brief    Target Interrupt Enable Register.
 * @{
 */
#define MXC_F_I3C_TARG_INTEN_START_POS                 8 /**< TARG_INTEN_START Position */
#define MXC_F_I3C_TARG_INTEN_START                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_START_POS)) /**< TARG_INTEN_START Mask */

#define MXC_F_I3C_TARG_INTEN_ADDRMATCH_POS             9 /**< TARG_INTEN_ADDRMATCH Position */
#define MXC_F_I3C_TARG_INTEN_ADDRMATCH                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_ADDRMATCH_POS)) /**< TARG_INTEN_ADDRMATCH Mask */

#define MXC_F_I3C_TARG_INTEN_STOP_POS                  10 /**< TARG_INTEN_STOP Position */
#define MXC_F_I3C_TARG_INTEN_STOP                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_STOP_POS)) /**< TARG_INTEN_STOP Mask */

#define MXC_F_I3C_TARG_INTEN_RX_RDY_POS                11 /**< TARG_INTEN_RX_RDY Position */
#define MXC_F_I3C_TARG_INTEN_RX_RDY                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_RX_RDY_POS)) /**< TARG_INTEN_RX_RDY Mask */

#define MXC_F_I3C_TARG_INTEN_TX_NFULL_POS              12 /**< TARG_INTEN_TX_NFULL Position */
#define MXC_F_I3C_TARG_INTEN_TX_NFULL                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_TX_NFULL_POS)) /**< TARG_INTEN_TX_NFULL Mask */

#define MXC_F_I3C_TARG_INTEN_DYNADDR_CHG_POS           13 /**< TARG_INTEN_DYNADDR_CHG Position */
#define MXC_F_I3C_TARG_INTEN_DYNADDR_CHG               ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_DYNADDR_CHG_POS)) /**< TARG_INTEN_DYNADDR_CHG Mask */

#define MXC_F_I3C_TARG_INTEN_CCC_POS                   14 /**< TARG_INTEN_CCC Position */
#define MXC_F_I3C_TARG_INTEN_CCC                       ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_CCC_POS)) /**< TARG_INTEN_CCC Mask */

