analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_INTEN_ERRWARN_POS               15 /**< TARG_INTEN_ERRWARN Position */
#define MXC_F_I3C_TARG_INTEN_ERRWARN                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_ERRWARN_POS)) /**< TARG_INTEN_ERRWARN Mask */

#define MXC_F_I3C_TARG_INTEN_CCCH_DONE_POS             17 /**< TARG_INTEN_CCCH_DONE Position */
#define MXC_F_I3C_TARG_INTEN_CCCH_DONE                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_CCCH_DONE_POS)) /**< TARG_INTEN_CCCH_DONE Mask */

#define MXC_F_I3C_TARG_INTEN_EVENT_REQ_POS             18 /**< TARG_INTEN_EVENT_REQ Position */
#define MXC_F_I3C_TARG_INTEN_EVENT_REQ                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_EVENT_REQ_POS)) /**< TARG_INTEN_EVENT_REQ Mask */

#define MXC_F_I3C_TARG_INTEN_TARG_RST_POS              19 /**< TARG_INTEN_TARG_RST Position */
#define MXC_F_I3C_TARG_INTEN_TARG_RST                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTEN_TARG_RST_POS)) /**< TARG_INTEN_TARG_RST Mask */

/**@} end of group I3C_TARG_INTEN_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_INTCLR I3C_TARG_INTCLR
 * @brief    Target Interrupt Clear Register.
 * @{
 */
#define MXC_F_I3C_TARG_INTCLR_START_POS                8 /**< TARG_INTCLR_START Position */
#define MXC_F_I3C_TARG_INTCLR_START                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_START_POS)) /**< TARG_INTCLR_START Mask */

#define MXC_F_I3C_TARG_INTCLR_ADDRMATCH_POS            9 /**< TARG_INTCLR_ADDRMATCH Position */
#define MXC_F_I3C_TARG_INTCLR_ADDRMATCH                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_ADDRMATCH_POS)) /**< TARG_INTCLR_ADDRMATCH Mask */

#define MXC_F_I3C_TARG_INTCLR_STOP_POS                 10 /**< TARG_INTCLR_STOP Position */
#define MXC_F_I3C_TARG_INTCLR_STOP                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_STOP_POS)) /**< TARG_INTCLR_STOP Mask */

#define MXC_F_I3C_TARG_INTCLR_RX_RDY_POS               11 /**< TARG_INTCLR_RX_RDY Position */
#define MXC_F_I3C_TARG_INTCLR_RX_RDY                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_RX_RDY_POS)) /**< TARG_INTCLR_RX_RDY Mask */

#define MXC_F_I3C_TARG_INTCLR_TX_NFULL_POS             12 /**< TARG_INTCLR_TX_NFULL Position */
#define MXC_F_I3C_TARG_INTCLR_TX_NFULL                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_TX_NFULL_POS)) /**< TARG_INTCLR_TX_NFULL Mask */

#define MXC_F_I3C_TARG_INTCLR_DYNADDR_CHG_POS          13 /**< TARG_INTCLR_DYNADDR_CHG Position */
#define MXC_F_I3C_TARG_INTCLR_DYNADDR_CHG              ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_DYNADDR_CHG_POS)) /**< TARG_INTCLR_DYNADDR_CHG Mask */

#define MXC_F_I3C_TARG_INTCLR_CCC_POS                  14 /**< TARG_INTCLR_CCC Position */
#define MXC_F_I3C_TARG_INTCLR_CCC                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_CCC_POS)) /**< TARG_INTCLR_CCC Mask */

#define MXC_F_I3C_TARG_INTCLR_ERRWARN_POS              15 /**< TARG_INTCLR_ERRWARN Position */
#define MXC_F_I3C_TARG_INTCLR_ERRWARN                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_ERRWARN_POS)) /**< TARG_INTCLR_ERRWARN Mask */

#define MXC_F_I3C_TARG_INTCLR_CCCH_DONE_POS            17 /**< TARG_INTCLR_CCCH_DONE Position */
#define MXC_F_I3C_TARG_INTCLR_CCCH_DONE                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_CCCH_DONE_POS)) /**< TARG_INTCLR_CCCH_DONE Mask */

#define MXC_F_I3C_TARG_INTCLR_EVENT_REQ_POS            18 /**< TARG_INTCLR_EVENT_REQ Position */
#define MXC_F_I3C_TARG_INTCLR_EVENT_REQ                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_EVENT_REQ_POS)) /**< TARG_INTCLR_EVENT_REQ Mask */

#define MXC_F_I3C_TARG_INTCLR_TARG_RST_POS             19 /**< TARG_INTCLR_TARG_RST Position */
#define MXC_F_I3C_TARG_INTCLR_TARG_RST                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTCLR_TARG_RST_POS)) /**< TARG_INTCLR_TARG_RST Mask */

/**@} end of group I3C_TARG_INTCLR_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_INTFL I3C_TARG_INTFL
 * @brief    Target Interrupt Flag Register.
 * @{
 */
#define MXC_F_I3C_TARG_INTFL_START_POS                 8 /**< TARG_INTFL_START Position */
#define MXC_F_I3C_TARG_INTFL_START                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_START_POS)) /**< TARG_INTFL_START Mask */

#define MXC_F_I3C_TARG_INTFL_ADDRMATCH_POS             9 /**< TARG_INTFL_ADDRMATCH Position */
#define MXC_F_I3C_TARG_INTFL_ADDRMATCH                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_ADDRMATCH_POS)) /**< TARG_INTFL_ADDRMATCH Mask */

#define MXC_F_I3C_TARG_INTFL_STOP_POS                  10 /**< TARG_INTFL_STOP Position */
#define MXC_F_I3C_TARG_INTFL_STOP                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_STOP_POS)) /**< TARG_INTFL_STOP Mask */

#define MXC_F_I3C_TARG_INTFL_RX_RDY_POS                11 /**< TARG_INTFL_RX_RDY Position */
#define MXC_F_I3C_TARG_INTFL_RX_RDY                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_RX_RDY_POS)) /**< TARG_INTFL_RX_RDY Mask */

#define MXC_F_I3C_TARG_INTFL_TX_NFULL_POS              12 /**< TARG_INTFL_TX_NFULL Position */
#define MXC_F_I3C_TARG_INTFL_TX_NFULL                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_TX_NFULL_POS)) /**< TARG_INTFL_TX_NFULL Mask */

#define MXC_F_I3C_TARG_INTFL_DYNADDR_CHG_POS           13 /**< TARG_INTFL_DYNADDR_CHG Position */
#define MXC_F_I3C_TARG_INTFL_DYNADDR_CHG               ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_DYNADDR_CHG_POS)) /**< TARG_INTFL_DYNADDR_CHG Mask */

#define MXC_F_I3C_TARG_INTFL_CCC_POS                   14 /**< TARG_INTFL_CCC Position */
#define MXC_F_I3C_TARG_INTFL_CCC                       ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_CCC_POS)) /**< TARG_INTFL_CCC Mask */

#define MXC_F_I3C_TARG_INTFL_ERRWARN_POS               15 /**< TARG_INTFL_ERRWARN Position */
#define MXC_F_I3C_TARG_INTFL_ERRWARN                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_ERRWARN_POS)) /**< TARG_INTFL_ERRWARN Mask */

#define MXC_F_I3C_TARG_INTFL_CCCH_DONE_POS             17 /**< TARG_INTFL_CCCH_DONE Position */
#define MXC_F_I3C_TARG_INTFL_CCCH_DONE                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_CCCH_DONE_POS)) /**< TARG_INTFL_CCCH_DONE Mask */

#define MXC_F_I3C_TARG_INTFL_EVENT_REQ_POS             18 /**< TARG_INTFL_EVENT_REQ Position */
#define MXC_F_I3C_TARG_INTFL_EVENT_REQ                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_EVENT_REQ_POS)) /**< TARG_INTFL_EVENT_REQ Mask */

#define MXC_F_I3C_TARG_INTFL_TARG_RST_POS              19 /**< TARG_INTFL_TARG_RST Position */
#define MXC_F_I3C_TARG_INTFL_TARG_RST                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_INTFL_TARG_RST_POS)) /**< TARG_INTFL_TARG_RST Mask */

/**@} end of group I3C_TARG_INTFL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_ERRWARN I3C_TARG_ERRWARN
 * @brief    Target Error and Warning Register.
 * @{
 */
#define MXC_F_I3C_TARG_ERRWARN_OVR_POS                 0 /**< TARG_ERRWARN_OVR Position */
#define MXC_F_I3C_TARG_ERRWARN_OVR                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_OVR_POS)) /**< TARG_ERRWARN_OVR Mask */

#define MXC_F_I3C_TARG_ERRWARN_UNR_POS                 1 /**< TARG_ERRWARN_UNR Position */
#define MXC_F_I3C_TARG_ERRWARN_UNR                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_UNR_POS)) /**< TARG_ERRWARN_UNR Mask */

#define MXC_F_I3C_TARG_ERRWARN_UNR_NACK_POS            2 /**< TARG_ERRWARN_UNR_NACK Position */
#define MXC_F_I3C_TARG_ERRWARN_UNR_NACK                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_UNR_NACK_POS)) /**< TARG_ERRWARN_UNR_NACK Mask */

#define MXC_F_I3C_TARG_ERRWARN_CONT_RX_TERM_POS        3 /**< TARG_ERRWARN_CONT_RX_TERM Position */
#define MXC_F_I3C_TARG_ERRWARN_CONT_RX_TERM            ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_CONT_RX_TERM_POS)) /**< TARG_ERRWARN_CONT_RX_TERM Mask */

#define MXC_F_I3C_TARG_ERRWARN_INVSTART_POS            4 /**< TARG_ERRWARN_INVSTART Position */
#define MXC_F_I3C_TARG_ERRWARN_INVSTART                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_INVSTART_POS)) /**< TARG_ERRWARN_INVSTART Mask */

#define MXC_F_I3C_TARG_ERRWARN_SDR_PAR_POS             8 /**< TARG_ERRWARN_SDR_PAR Position */
#define MXC_F_I3C_TARG_ERRWARN_SDR_PAR                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_SDR_PAR_POS)) /**< TARG_ERRWARN_SDR_PAR Mask */

#define MXC_F_I3C_TARG_ERRWARN_TO_POS                  11 /**< TARG_ERRWARN_TO Position */
#define MXC_F_I3C_TARG_ERRWARN_TO                      ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_TO_POS)) /**< TARG_ERRWARN_TO Mask */

#define MXC_F_I3C_TARG_ERRWARN_RX_UNR_POS              16 /**< TARG_ERRWARN_RX_UNR Position */
#define MXC_F_I3C_TARG_ERRWARN_RX_UNR                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_RX_UNR_POS)) /**< TARG_ERRWARN_RX_UNR Mask */

#define MXC_F_I3C_TARG_ERRWARN_TX_OVR_POS              17 /**< TARG_ERRWARN_TX_OVR Position */
#define MXC_F_I3C_TARG_ERRWARN_TX_OVR                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_ERRWARN_TX_OVR_POS)) /**< TARG_ERRWARN_TX_OVR Mask */

/**@} end of group I3C_TARG_ERRWARN_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_DMACTRL I3C_TARG_DMACTRL
 * @brief    Target DMA Control Register.
 * @{
 */
#define MXC_F_I3C_TARG_DMACTRL_RX_EN_POS               0 /**< TARG_DMACTRL_RX_EN Position */
#define MXC_F_I3C_TARG_DMACTRL_RX_EN                   ((uint32_t)(0x3UL << MXC_F_I3C_TARG_DMACTRL_RX_EN_POS)) /**< TARG_DMACTRL_RX_EN Mask */
#define MXC_V_I3C_TARG_DMACTRL_RX_EN_DIS               ((uint32_t)0x0UL) /**< TARG_DMACTRL_RX_EN_DIS Value */
#define MXC_S_I3C_TARG_DMACTRL_RX_EN_DIS               (MXC_V_I3C_TARG_DMACTRL_RX_EN_DIS << MXC_F_I3C_TARG_DMACTRL_RX_EN_POS) /**< TARG_DMACTRL_RX_EN_DIS Setting */
#define MXC_V_I3C_TARG_DMACTRL_RX_EN_ONE_FR            ((uint32_t)0x1UL) /**< TARG_DMACTRL_RX_EN_ONE_FR Value */
#define MXC_S_I3C_TARG_DMACTRL_RX_EN_ONE_FR            (MXC_V_I3C_TARG_DMACTRL_RX_EN_ONE_FR << MXC_F_I3C_TARG_DMACTRL_RX_EN_POS) /**< TARG_DMACTRL_RX_EN_ONE_FR Setting */
#define MXC_V_I3C_TARG_DMACTRL_RX_EN_EN                ((uint32_t)0x2UL) /**< TARG_DMACTRL_RX_EN_EN Value */
#define MXC_S_I3C_TARG_DMACTRL_RX_EN_EN                (MXC_V_I3C_TARG_DMACTRL_RX_EN_EN << MXC_F_I3C_TARG_DMACTRL_RX_EN_POS) /**< TARG_DMACTRL_RX_EN_EN Setting */

