analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_DMACTRL_TX_EN_POS               2 /**< TARG_DMACTRL_TX_EN Position */
#define MXC_F_I3C_TARG_DMACTRL_TX_EN                   ((uint32_t)(0x3UL << MXC_F_I3C_TARG_DMACTRL_TX_EN_POS)) /**< TARG_DMACTRL_TX_EN Mask */
#define MXC_V_I3C_TARG_DMACTRL_TX_EN_DIS               ((uint32_t)0x0UL) /**< TARG_DMACTRL_TX_EN_DIS Value */
#define MXC_S_I3C_TARG_DMACTRL_TX_EN_DIS               (MXC_V_I3C_TARG_DMACTRL_TX_EN_DIS << MXC_F_I3C_TARG_DMACTRL_TX_EN_POS) /**< TARG_DMACTRL_TX_EN_DIS Setting */
#define MXC_V_I3C_TARG_DMACTRL_TX_EN_ONE_FR            ((uint32_t)0x1UL) /**< TARG_DMACTRL_TX_EN_ONE_FR Value */
#define MXC_S_I3C_TARG_DMACTRL_TX_EN_ONE_FR            (MXC_V_I3C_TARG_DMACTRL_TX_EN_ONE_FR << MXC_F_I3C_TARG_DMACTRL_TX_EN_POS) /**< TARG_DMACTRL_TX_EN_ONE_FR Setting */
#define MXC_V_I3C_TARG_DMACTRL_TX_EN_EN                ((uint32_t)0x2UL) /**< TARG_DMACTRL_TX_EN_EN Value */
#define MXC_S_I3C_TARG_DMACTRL_TX_EN_EN                (MXC_V_I3C_TARG_DMACTRL_TX_EN_EN << MXC_F_I3C_TARG_DMACTRL_TX_EN_POS) /**< TARG_DMACTRL_TX_EN_EN Setting */

#define MXC_F_I3C_TARG_DMACTRL_WIDTH_POS               4 /**< TARG_DMACTRL_WIDTH Position */
#define MXC_F_I3C_TARG_DMACTRL_WIDTH                   ((uint32_t)(0x3UL << MXC_F_I3C_TARG_DMACTRL_WIDTH_POS)) /**< TARG_DMACTRL_WIDTH Mask */
#define MXC_V_I3C_TARG_DMACTRL_WIDTH_BYTE              ((uint32_t)0x0UL) /**< TARG_DMACTRL_WIDTH_BYTE Value */
#define MXC_S_I3C_TARG_DMACTRL_WIDTH_BYTE              (MXC_V_I3C_TARG_DMACTRL_WIDTH_BYTE << MXC_F_I3C_TARG_DMACTRL_WIDTH_POS) /**< TARG_DMACTRL_WIDTH_BYTE Setting */
#define MXC_V_I3C_TARG_DMACTRL_WIDTH_HALFWORD          ((uint32_t)0x2UL) /**< TARG_DMACTRL_WIDTH_HALFWORD Value */
#define MXC_S_I3C_TARG_DMACTRL_WIDTH_HALFWORD          (MXC_V_I3C_TARG_DMACTRL_WIDTH_HALFWORD << MXC_F_I3C_TARG_DMACTRL_WIDTH_POS) /**< TARG_DMACTRL_WIDTH_HALFWORD Setting */

/**@} end of group I3C_TARG_DMACTRL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_FIFOCTRL I3C_TARG_FIFOCTRL
 * @brief    Target FIFO Control Register.
 * @{
 */
#define MXC_F_I3C_TARG_FIFOCTRL_TX_FLUSH_POS           0 /**< TARG_FIFOCTRL_TX_FLUSH Position */
#define MXC_F_I3C_TARG_FIFOCTRL_TX_FLUSH               ((uint32_t)(0x1UL << MXC_F_I3C_TARG_FIFOCTRL_TX_FLUSH_POS)) /**< TARG_FIFOCTRL_TX_FLUSH Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_RX_FLUSH_POS           1 /**< TARG_FIFOCTRL_RX_FLUSH Position */
#define MXC_F_I3C_TARG_FIFOCTRL_RX_FLUSH               ((uint32_t)(0x1UL << MXC_F_I3C_TARG_FIFOCTRL_RX_FLUSH_POS)) /**< TARG_FIFOCTRL_RX_FLUSH Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_UNLOCK_POS             3 /**< TARG_FIFOCTRL_UNLOCK Position */
#define MXC_F_I3C_TARG_FIFOCTRL_UNLOCK                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_FIFOCTRL_UNLOCK_POS)) /**< TARG_FIFOCTRL_UNLOCK Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS         4 /**< TARG_FIFOCTRL_TX_THD_LVL Position */
#define MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL             ((uint32_t)(0x3UL << MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS)) /**< TARG_FIFOCTRL_TX_THD_LVL Mask */
#define MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_EMPTY       ((uint32_t)0x0UL) /**< TARG_FIFOCTRL_TX_THD_LVL_EMPTY Value */
#define MXC_S_I3C_TARG_FIFOCTRL_TX_THD_LVL_EMPTY       (MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_EMPTY << MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS) /**< TARG_FIFOCTRL_TX_THD_LVL_EMPTY Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_QUARTER_FULL ((uint32_t)0x1UL) /**< TARG_FIFOCTRL_TX_THD_LVL_QUARTER_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_TX_THD_LVL_QUARTER_FULL (MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_QUARTER_FULL << MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS) /**< TARG_FIFOCTRL_TX_THD_LVL_QUARTER_FULL Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_HALF_FULL   ((uint32_t)0x2UL) /**< TARG_FIFOCTRL_TX_THD_LVL_HALF_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_TX_THD_LVL_HALF_FULL   (MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_HALF_FULL << MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS) /**< TARG_FIFOCTRL_TX_THD_LVL_HALF_FULL Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_ALMOST_FULL ((uint32_t)0x3UL) /**< TARG_FIFOCTRL_TX_THD_LVL_ALMOST_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_TX_THD_LVL_ALMOST_FULL (MXC_V_I3C_TARG_FIFOCTRL_TX_THD_LVL_ALMOST_FULL << MXC_F_I3C_TARG_FIFOCTRL_TX_THD_LVL_POS) /**< TARG_FIFOCTRL_TX_THD_LVL_ALMOST_FULL Setting */

#define MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS         6 /**< TARG_FIFOCTRL_RX_THD_LVL Position */
#define MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL             ((uint32_t)(0x3UL << MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS)) /**< TARG_FIFOCTRL_RX_THD_LVL Mask */
#define MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_NOT_EMPTY   ((uint32_t)0x0UL) /**< TARG_FIFOCTRL_RX_THD_LVL_NOT_EMPTY Value */
#define MXC_S_I3C_TARG_FIFOCTRL_RX_THD_LVL_NOT_EMPTY   (MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_NOT_EMPTY << MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS) /**< TARG_FIFOCTRL_RX_THD_LVL_NOT_EMPTY Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_QUARTER_FULL ((uint32_t)0x1UL) /**< TARG_FIFOCTRL_RX_THD_LVL_QUARTER_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_RX_THD_LVL_QUARTER_FULL (MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_QUARTER_FULL << MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS) /**< TARG_FIFOCTRL_RX_THD_LVL_QUARTER_FULL Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_HALF_FULL   ((uint32_t)0x2UL) /**< TARG_FIFOCTRL_RX_THD_LVL_HALF_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_RX_THD_LVL_HALF_FULL   (MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_HALF_FULL << MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS) /**< TARG_FIFOCTRL_RX_THD_LVL_HALF_FULL Setting */
#define MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL ((uint32_t)0x3UL) /**< TARG_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL Value */
#define MXC_S_I3C_TARG_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL (MXC_V_I3C_TARG_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL << MXC_F_I3C_TARG_FIFOCTRL_RX_THD_LVL_POS) /**< TARG_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL Setting */

#define MXC_F_I3C_TARG_FIFOCTRL_TX_LVL_POS             16 /**< TARG_FIFOCTRL_TX_LVL Position */
#define MXC_F_I3C_TARG_FIFOCTRL_TX_LVL                 ((uint32_t)(0x3FUL << MXC_F_I3C_TARG_FIFOCTRL_TX_LVL_POS)) /**< TARG_FIFOCTRL_TX_LVL Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_RX_LVL_POS             24 /**< TARG_FIFOCTRL_RX_LVL Position */
#define MXC_F_I3C_TARG_FIFOCTRL_RX_LVL                 ((uint32_t)(0x3FUL << MXC_F_I3C_TARG_FIFOCTRL_RX_LVL_POS)) /**< TARG_FIFOCTRL_RX_LVL Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_TX_FULL_POS            30 /**< TARG_FIFOCTRL_TX_FULL Position */
#define MXC_F_I3C_TARG_FIFOCTRL_TX_FULL                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_FIFOCTRL_TX_FULL_POS)) /**< TARG_FIFOCTRL_TX_FULL Mask */

#define MXC_F_I3C_TARG_FIFOCTRL_RX_EM_POS              31 /**< TARG_FIFOCTRL_RX_EM Position */
#define MXC_F_I3C_TARG_FIFOCTRL_RX_EM                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_FIFOCTRL_RX_EM_POS)) /**< TARG_FIFOCTRL_RX_EM Mask */

/**@} end of group I3C_TARG_FIFOCTRL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_TXFIFO8 I3C_TARG_TXFIFO8
 * @brief    Target Write Byte Data Register.
 * @{
 */
#define MXC_F_I3C_TARG_TXFIFO8_DATA_POS                0 /**< TARG_TXFIFO8_DATA Position */
#define MXC_F_I3C_TARG_TXFIFO8_DATA                    ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_TXFIFO8_DATA_POS)) /**< TARG_TXFIFO8_DATA Mask */

#define MXC_F_I3C_TARG_TXFIFO8_END_POS                 8 /**< TARG_TXFIFO8_END Position */
#define MXC_F_I3C_TARG_TXFIFO8_END                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_TXFIFO8_END_POS)) /**< TARG_TXFIFO8_END Mask */

#define MXC_F_I3C_TARG_TXFIFO8_END2_POS                16 /**< TARG_TXFIFO8_END2 Position */
#define MXC_F_I3C_TARG_TXFIFO8_END2                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_TXFIFO8_END2_POS)) /**< TARG_TXFIFO8_END2 Mask */

/**@} end of group I3C_TARG_TXFIFO8_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_TXFIFO8E I3C_TARG_TXFIFO8E
 * @brief    Target Write Byte Data as End Register.
 * @{
 */
#define MXC_F_I3C_TARG_TXFIFO8E_DATA_POS               0 /**< TARG_TXFIFO8E_DATA Position */
#define MXC_F_I3C_TARG_TXFIFO8E_DATA                   ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_TXFIFO8E_DATA_POS)) /**< TARG_TXFIFO8E_DATA Mask */

