analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
/**@} end of group I3C_TARG_TXFIFO8E_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_TXFIFO16 I3C_TARG_TXFIFO16
 * @brief    Target Write Half-Word Data Register.
 * @{
 */
#define MXC_F_I3C_TARG_TXFIFO16_DATA_POS               0 /**< TARG_TXFIFO16_DATA Position */
#define MXC_F_I3C_TARG_TXFIFO16_DATA                   ((uint32_t)(0xFFFFUL << MXC_F_I3C_TARG_TXFIFO16_DATA_POS)) /**< TARG_TXFIFO16_DATA Mask */

#define MXC_F_I3C_TARG_TXFIFO16_END_POS                16 /**< TARG_TXFIFO16_END Position */
#define MXC_F_I3C_TARG_TXFIFO16_END                    ((uint32_t)(0x1UL << MXC_F_I3C_TARG_TXFIFO16_END_POS)) /**< TARG_TXFIFO16_END Mask */

/**@} end of group I3C_TARG_TXFIFO16_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_TXFIFO16E I3C_TARG_TXFIFO16E
 * @brief    Target Write Half-Word Data as End Register.
 * @{
 */
#define MXC_F_I3C_TARG_TXFIFO16E_DATA_POS              0 /**< TARG_TXFIFO16E_DATA Position */
#define MXC_F_I3C_TARG_TXFIFO16E_DATA                  ((uint32_t)(0xFFFFUL << MXC_F_I3C_TARG_TXFIFO16E_DATA_POS)) /**< TARG_TXFIFO16E_DATA Mask */

/**@} end of group I3C_TARG_TXFIFO16E_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_RXFIFO8 I3C_TARG_RXFIFO8
 * @brief    Target Read Byte Data Register.
 * @{
 */
#define MXC_F_I3C_TARG_RXFIFO8_DATA_POS                0 /**< TARG_RXFIFO8_DATA Position */
#define MXC_F_I3C_TARG_RXFIFO8_DATA                    ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_RXFIFO8_DATA_POS)) /**< TARG_RXFIFO8_DATA Mask */

/**@} end of group I3C_TARG_RXFIFO8_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_RXFIFO16 I3C_TARG_RXFIFO16
 * @brief    Target Read Half-Word Data Register.
 * @{
 */
#define MXC_F_I3C_TARG_RXFIFO16_DATA_POS               0 /**< TARG_RXFIFO16_DATA Position */
#define MXC_F_I3C_TARG_RXFIFO16_DATA                   ((uint32_t)(0xFFFFUL << MXC_F_I3C_TARG_RXFIFO16_DATA_POS)) /**< TARG_RXFIFO16_DATA Mask */

/**@} end of group I3C_TARG_RXFIFO16_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_TXFIFO8O I3C_TARG_TXFIFO8O
 * @brief    Target Byte-Only Write Byte Data Register.
 * @{
 */
#define MXC_F_I3C_TARG_TXFIFO8O_DATA_POS               0 /**< TARG_TXFIFO8O_DATA Position */
#define MXC_F_I3C_TARG_TXFIFO8O_DATA                   ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_TXFIFO8O_DATA_POS)) /**< TARG_TXFIFO8O_DATA Mask */

/**@} end of group I3C_TARG_TXFIFO8O_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_CAP0 I3C_TARG_CAP0
 * @brief    Target Capabilities 0 Register.
 * @{
 */
#define MXC_F_I3C_TARG_CAP0_MAPCNT_POS                 0 /**< TARG_CAP0_MAPCNT Position */
#define MXC_F_I3C_TARG_CAP0_MAPCNT                     ((uint32_t)(0xFUL << MXC_F_I3C_TARG_CAP0_MAPCNT_POS)) /**< TARG_CAP0_MAPCNT Mask */

#define MXC_F_I3C_TARG_CAP0_I2C_10BADDR_POS            4 /**< TARG_CAP0_I2C_10BADDR Position */
#define MXC_F_I3C_TARG_CAP0_I2C_10BADDR                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_I2C_10BADDR_POS)) /**< TARG_CAP0_I2C_10BADDR Mask */

#define MXC_F_I3C_TARG_CAP0_I2C_SWRST_POS              5 /**< TARG_CAP0_I2C_SWRST Position */
#define MXC_F_I3C_TARG_CAP0_I2C_SWRST                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_I2C_SWRST_POS)) /**< TARG_CAP0_I2C_SWRST Mask */

#define MXC_F_I3C_TARG_CAP0_I2C_DEVID_POS              6 /**< TARG_CAP0_I2C_DEVID Position */
#define MXC_F_I3C_TARG_CAP0_I2C_DEVID                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_I2C_DEVID_POS)) /**< TARG_CAP0_I2C_DEVID Mask */

#define MXC_F_I3C_TARG_CAP0_FIFO32_REG_POS             7 /**< TARG_CAP0_FIFO32_REG Position */
#define MXC_F_I3C_TARG_CAP0_FIFO32_REG                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_FIFO32_REG_POS)) /**< TARG_CAP0_FIFO32_REG Mask */

#define MXC_F_I3C_TARG_CAP0_EXTIBI_POS                 8 /**< TARG_CAP0_EXTIBI Position */
#define MXC_F_I3C_TARG_CAP0_EXTIBI                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_EXTIBI_POS)) /**< TARG_CAP0_EXTIBI Mask */

#define MXC_F_I3C_TARG_CAP0_EXTIBI_REG_POS             9 /**< TARG_CAP0_EXTIBI_REG Position */
#define MXC_F_I3C_TARG_CAP0_EXTIBI_REG                 ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_EXTIBI_REG_POS)) /**< TARG_CAP0_EXTIBI_REG Mask */

#define MXC_F_I3C_TARG_CAP0_HDRBT_LANES_POS            12 /**< TARG_CAP0_HDRBT_LANES Position */
#define MXC_F_I3C_TARG_CAP0_HDRBT_LANES                ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP0_HDRBT_LANES_POS)) /**< TARG_CAP0_HDRBT_LANES Mask */

#define MXC_F_I3C_TARG_CAP0_CCC_V1_1_POS               16 /**< TARG_CAP0_CCC_V1_1 Position */
#define MXC_F_I3C_TARG_CAP0_CCC_V1_1                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_CCC_V1_1_POS)) /**< TARG_CAP0_CCC_V1_1 Mask */

#define MXC_F_I3C_TARG_CAP0_TARG_RST_POS               17 /**< TARG_CAP0_TARG_RST Position */
#define MXC_F_I3C_TARG_CAP0_TARG_RST                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_TARG_RST_POS)) /**< TARG_CAP0_TARG_RST Mask */

#define MXC_F_I3C_TARG_CAP0_GROUPADDR_POS              18 /**< TARG_CAP0_GROUPADDR Position */
#define MXC_F_I3C_TARG_CAP0_GROUPADDR                  ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP0_GROUPADDR_POS)) /**< TARG_CAP0_GROUPADDR Mask */

#define MXC_F_I3C_TARG_CAP0_AASA_CCC_POS               21 /**< TARG_CAP0_AASA_CCC Position */
#define MXC_F_I3C_TARG_CAP0_AASA_CCC                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_AASA_CCC_POS)) /**< TARG_CAP0_AASA_CCC Mask */

#define MXC_F_I3C_TARG_CAP0_T2T_SUBSC_POS              22 /**< TARG_CAP0_T2T_SUBSC Position */
#define MXC_F_I3C_TARG_CAP0_T2T_SUBSC                  ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_T2T_SUBSC_POS)) /**< TARG_CAP0_T2T_SUBSC Mask */

#define MXC_F_I3C_TARG_CAP0_T2T_WR_POS                 23 /**< TARG_CAP0_T2T_WR Position */
#define MXC_F_I3C_TARG_CAP0_T2T_WR                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP0_T2T_WR_POS)) /**< TARG_CAP0_T2T_WR Mask */

/**@} end of group I3C_TARG_CAP0_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_CAP1 I3C_TARG_CAP1
 * @brief    TARG_Capabilities 1 Register.
 * @{
 */
#define MXC_F_I3C_TARG_CAP1_PROVID_POS                 0 /**< TARG_CAP1_PROVID Position */
#define MXC_F_I3C_TARG_CAP1_PROVID                     ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP1_PROVID_POS)) /**< TARG_CAP1_PROVID Mask */

#define MXC_F_I3C_TARG_CAP1_PROVID_REG_POS             2 /**< TARG_CAP1_PROVID_REG Position */
#define MXC_F_I3C_TARG_CAP1_PROVID_REG                 ((uint32_t)(0xFUL << MXC_F_I3C_TARG_CAP1_PROVID_REG_POS)) /**< TARG_CAP1_PROVID_REG Mask */

#define MXC_F_I3C_TARG_CAP1_HDR_MODES_POS              6 /**< TARG_CAP1_HDR_MODES Position */
#define MXC_F_I3C_TARG_CAP1_HDR_MODES                  ((uint32_t)(0x7UL << MXC_F_I3C_TARG_CAP1_HDR_MODES_POS)) /**< TARG_CAP1_HDR_MODES Mask */

#define MXC_F_I3C_TARG_CAP1_CONT_POS                   9 /**< TARG_CAP1_CONT Position */
#define MXC_F_I3C_TARG_CAP1_CONT                       ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP1_CONT_POS)) /**< TARG_CAP1_CONT Mask */

#define MXC_F_I3C_TARG_CAP1_STATADDR_POS               10 /**< TARG_CAP1_STATADDR Position */
#define MXC_F_I3C_TARG_CAP1_STATADDR                   ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP1_STATADDR_POS)) /**< TARG_CAP1_STATADDR Mask */

#define MXC_F_I3C_TARG_CAP1_CCCH_POS                   12 /**< TARG_CAP1_CCCH Position */
#define MXC_F_I3C_TARG_CAP1_CCCH                       ((uint32_t)(0xFUL << MXC_F_I3C_TARG_CAP1_CCCH_POS)) /**< TARG_CAP1_CCCH Mask */

#define MXC_F_I3C_TARG_CAP1_IBI_EVENTS_POS             16 /**< TARG_CAP1_IBI_EVENTS Position */
#define MXC_F_I3C_TARG_CAP1_IBI_EVENTS                 ((uint32_t)(0x1FUL << MXC_F_I3C_TARG_CAP1_IBI_EVENTS_POS)) /**< TARG_CAP1_IBI_EVENTS Mask */

