analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_CAP1_TIMECTRL_POS               21 /**< TARG_CAP1_TIMECTRL Position */
#define MXC_F_I3C_TARG_CAP1_TIMECTRL                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP1_TIMECTRL_POS)) /**< TARG_CAP1_TIMECTRL Mask */

#define MXC_F_I3C_TARG_CAP1_EXTFIFO_POS                23 /**< TARG_CAP1_EXTFIFO Position */
#define MXC_F_I3C_TARG_CAP1_EXTFIFO                    ((uint32_t)(0x7UL << MXC_F_I3C_TARG_CAP1_EXTFIFO_POS)) /**< TARG_CAP1_EXTFIFO Mask */

#define MXC_F_I3C_TARG_CAP1_TXFIFO_CFG_POS             26 /**< TARG_CAP1_TXFIFO_CFG Position */
#define MXC_F_I3C_TARG_CAP1_TXFIFO_CFG                 ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP1_TXFIFO_CFG_POS)) /**< TARG_CAP1_TXFIFO_CFG Mask */

#define MXC_F_I3C_TARG_CAP1_RXFIFO_CFG_POS             28 /**< TARG_CAP1_RXFIFO_CFG Position */
#define MXC_F_I3C_TARG_CAP1_RXFIFO_CFG                 ((uint32_t)(0x3UL << MXC_F_I3C_TARG_CAP1_RXFIFO_CFG_POS)) /**< TARG_CAP1_RXFIFO_CFG Mask */

#define MXC_F_I3C_TARG_CAP1_INTR_POS                   30 /**< TARG_CAP1_INTR Position */
#define MXC_F_I3C_TARG_CAP1_INTR                       ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP1_INTR_POS)) /**< TARG_CAP1_INTR Mask */

#define MXC_F_I3C_TARG_CAP1_DMA_POS                    31 /**< TARG_CAP1_DMA Position */
#define MXC_F_I3C_TARG_CAP1_DMA                        ((uint32_t)(0x1UL << MXC_F_I3C_TARG_CAP1_DMA_POS)) /**< TARG_CAP1_DMA Mask */

/**@} end of group I3C_TARG_CAP1_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_DYNADDR I3C_TARG_DYNADDR
 * @brief    Target Dynamic Address Register.
 * @{
 */
#define MXC_F_I3C_TARG_DYNADDR_VALID_POS               0 /**< TARG_DYNADDR_VALID Position */
#define MXC_F_I3C_TARG_DYNADDR_VALID                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_DYNADDR_VALID_POS)) /**< TARG_DYNADDR_VALID Mask */

#define MXC_F_I3C_TARG_DYNADDR_ADDR_POS                1 /**< TARG_DYNADDR_ADDR Position */
#define MXC_F_I3C_TARG_DYNADDR_ADDR                    ((uint32_t)(0x7FUL << MXC_F_I3C_TARG_DYNADDR_ADDR_POS)) /**< TARG_DYNADDR_ADDR Mask */

#define MXC_F_I3C_TARG_DYNADDR_CAUSE_POS               8 /**< TARG_DYNADDR_CAUSE Position */
#define MXC_F_I3C_TARG_DYNADDR_CAUSE                   ((uint32_t)(0x7UL << MXC_F_I3C_TARG_DYNADDR_CAUSE_POS)) /**< TARG_DYNADDR_CAUSE Mask */

/**@} end of group I3C_TARG_DYNADDR_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_MAXLIMITS I3C_TARG_MAXLIMITS
 * @brief    Maximum Limits Register.
 * @{
 */
#define MXC_F_I3C_TARG_MAXLIMITS_RX_POS                0 /**< TARG_MAXLIMITS_RX Position */
#define MXC_F_I3C_TARG_MAXLIMITS_RX                    ((uint32_t)(0xFFFUL << MXC_F_I3C_TARG_MAXLIMITS_RX_POS)) /**< TARG_MAXLIMITS_RX Mask */

#define MXC_F_I3C_TARG_MAXLIMITS_TX_POS                16 /**< TARG_MAXLIMITS_TX Position */
#define MXC_F_I3C_TARG_MAXLIMITS_TX                    ((uint32_t)(0xFFFUL << MXC_F_I3C_TARG_MAXLIMITS_TX_POS)) /**< TARG_MAXLIMITS_TX Mask */

/**@} end of group I3C_TARG_MAXLIMITS_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_IDEXT I3C_TARG_IDEXT
 * @brief    ID Extension Register.
 * @{
 */
#define MXC_F_I3C_TARG_IDEXT_DEVCHAR_POS               8 /**< TARG_IDEXT_DEVCHAR Position */
#define MXC_F_I3C_TARG_IDEXT_DEVCHAR                   ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_IDEXT_DEVCHAR_POS)) /**< TARG_IDEXT_DEVCHAR Mask */

#define MXC_F_I3C_TARG_IDEXT_BUSCHAR_POS               16 /**< TARG_IDEXT_BUSCHAR Position */
#define MXC_F_I3C_TARG_IDEXT_BUSCHAR                   ((uint32_t)(0xFFUL << MXC_F_I3C_TARG_IDEXT_BUSCHAR_POS)) /**< TARG_IDEXT_BUSCHAR Mask */

/**@} end of group I3C_TARG_IDEXT_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_MSGLAST I3C_TARG_MSGLAST
 * @brief    Target Matching Address Index Register.
 * @{
 */
#define MXC_F_I3C_TARG_MSGLAST_IDX_POS                 0 /**< TARG_MSGLAST_IDX Position */
#define MXC_F_I3C_TARG_MSGLAST_IDX                     ((uint32_t)(0xFUL << MXC_F_I3C_TARG_MSGLAST_IDX_POS)) /**< TARG_MSGLAST_IDX Mask */

#define MXC_F_I3C_TARG_MSGLAST_STATADDR_POS            4 /**< TARG_MSGLAST_STATADDR Position */
#define MXC_F_I3C_TARG_MSGLAST_STATADDR                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MSGLAST_STATADDR_POS)) /**< TARG_MSGLAST_STATADDR Mask */

#define MXC_F_I3C_TARG_MSGLAST_GROUP_POS               5 /**< TARG_MSGLAST_GROUP Position */
#define MXC_F_I3C_TARG_MSGLAST_GROUP                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MSGLAST_GROUP_POS)) /**< TARG_MSGLAST_GROUP Mask */

#define MXC_F_I3C_TARG_MSGLAST_MODE_POS                6 /**< TARG_MSGLAST_MODE Position */
#define MXC_F_I3C_TARG_MSGLAST_MODE                    ((uint32_t)(0x3UL << MXC_F_I3C_TARG_MSGLAST_MODE_POS)) /**< TARG_MSGLAST_MODE Mask */
#define MXC_V_I3C_TARG_MSGLAST_MODE_DYN_STAT_ADDR      ((uint32_t)0x0UL) /**< TARG_MSGLAST_MODE_DYN_STAT_ADDR Value */
#define MXC_S_I3C_TARG_MSGLAST_MODE_DYN_STAT_ADDR      (MXC_V_I3C_TARG_MSGLAST_MODE_DYN_STAT_ADDR << MXC_F_I3C_TARG_MSGLAST_MODE_POS) /**< TARG_MSGLAST_MODE_DYN_STAT_ADDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_MODE_HDR_DDR            ((uint32_t)0x1UL) /**< TARG_MSGLAST_MODE_HDR_DDR Value */
#define MXC_S_I3C_TARG_MSGLAST_MODE_HDR_DDR            (MXC_V_I3C_TARG_MSGLAST_MODE_HDR_DDR << MXC_F_I3C_TARG_MSGLAST_MODE_POS) /**< TARG_MSGLAST_MODE_HDR_DDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_MODE_HDR_BT             ((uint32_t)0x2UL) /**< TARG_MSGLAST_MODE_HDR_BT Value */
#define MXC_S_I3C_TARG_MSGLAST_MODE_HDR_BT             (MXC_V_I3C_TARG_MSGLAST_MODE_HDR_BT << MXC_F_I3C_TARG_MSGLAST_MODE_POS) /**< TARG_MSGLAST_MODE_HDR_BT Setting */

#define MXC_F_I3C_TARG_MSGLAST_PREV_IDX_POS            8 /**< TARG_MSGLAST_PREV_IDX Position */
#define MXC_F_I3C_TARG_MSGLAST_PREV_IDX                ((uint32_t)(0xFUL << MXC_F_I3C_TARG_MSGLAST_PREV_IDX_POS)) /**< TARG_MSGLAST_PREV_IDX Mask */

#define MXC_F_I3C_TARG_MSGLAST_PREV_GROUP_POS          13 /**< TARG_MSGLAST_PREV_GROUP Position */
#define MXC_F_I3C_TARG_MSGLAST_PREV_GROUP              ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MSGLAST_PREV_GROUP_POS)) /**< TARG_MSGLAST_PREV_GROUP Mask */

#define MXC_F_I3C_TARG_MSGLAST_PREV_MODE_POS           14 /**< TARG_MSGLAST_PREV_MODE Position */
#define MXC_F_I3C_TARG_MSGLAST_PREV_MODE               ((uint32_t)(0x3UL << MXC_F_I3C_TARG_MSGLAST_PREV_MODE_POS)) /**< TARG_MSGLAST_PREV_MODE Mask */
#define MXC_V_I3C_TARG_MSGLAST_PREV_MODE_DYN_STAT_ADDR ((uint32_t)0x0UL) /**< TARG_MSGLAST_PREV_MODE_DYN_STAT_ADDR Value */
#define MXC_S_I3C_TARG_MSGLAST_PREV_MODE_DYN_STAT_ADDR (MXC_V_I3C_TARG_MSGLAST_PREV_MODE_DYN_STAT_ADDR << MXC_F_I3C_TARG_MSGLAST_PREV_MODE_POS) /**< TARG_MSGLAST_PREV_MODE_DYN_STAT_ADDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_PREV_MODE_HDR_DDR       ((uint32_t)0x1UL) /**< TARG_MSGLAST_PREV_MODE_HDR_DDR Value */
#define MXC_S_I3C_TARG_MSGLAST_PREV_MODE_HDR_DDR       (MXC_V_I3C_TARG_MSGLAST_PREV_MODE_HDR_DDR << MXC_F_I3C_TARG_MSGLAST_PREV_MODE_POS) /**< TARG_MSGLAST_PREV_MODE_HDR_DDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_PREV_MODE_HDR_BT        ((uint32_t)0x2UL) /**< TARG_MSGLAST_PREV_MODE_HDR_BT Value */
#define MXC_S_I3C_TARG_MSGLAST_PREV_MODE_HDR_BT        (MXC_V_I3C_TARG_MSGLAST_PREV_MODE_HDR_BT << MXC_F_I3C_TARG_MSGLAST_PREV_MODE_POS) /**< TARG_MSGLAST_PREV_MODE_HDR_BT Setting */

#define MXC_F_I3C_TARG_MSGLAST_SECPREV_IDX_POS         16 /**< TARG_MSGLAST_SECPREV_IDX Position */
#define MXC_F_I3C_TARG_MSGLAST_SECPREV_IDX             ((uint32_t)(0xFUL << MXC_F_I3C_TARG_MSGLAST_SECPREV_IDX_POS)) /**< TARG_MSGLAST_SECPREV_IDX Mask */

#define MXC_F_I3C_TARG_MSGLAST_SECPREV_GROUP_POS       21 /**< TARG_MSGLAST_SECPREV_GROUP Position */
#define MXC_F_I3C_TARG_MSGLAST_SECPREV_GROUP           ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MSGLAST_SECPREV_GROUP_POS)) /**< TARG_MSGLAST_SECPREV_GROUP Mask */

#define MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE_POS        22 /**< TARG_MSGLAST_SECPREV_MODE Position */
#define MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE            ((uint32_t)(0x3UL << MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE_POS)) /**< TARG_MSGLAST_SECPREV_MODE Mask */
#define MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_DYN_STAT_ADDR ((uint32_t)0x0UL) /**< TARG_MSGLAST_SECPREV_MODE_DYN_STAT_ADDR Value */
#define MXC_S_I3C_TARG_MSGLAST_SECPREV_MODE_DYN_STAT_ADDR (MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_DYN_STAT_ADDR << MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE_POS) /**< TARG_MSGLAST_SECPREV_MODE_DYN_STAT_ADDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_DDR    ((uint32_t)0x1UL) /**< TARG_MSGLAST_SECPREV_MODE_HDR_DDR Value */
#define MXC_S_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_DDR    (MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_DDR << MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE_POS) /**< TARG_MSGLAST_SECPREV_MODE_HDR_DDR Setting */
#define MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_BT     ((uint32_t)0x2UL) /**< TARG_MSGLAST_SECPREV_MODE_HDR_BT Value */
#define MXC_S_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_BT     (MXC_V_I3C_TARG_MSGLAST_SECPREV_MODE_HDR_BT << MXC_F_I3C_TARG_MSGLAST_SECPREV_MODE_POS) /**< TARG_MSGLAST_SECPREV_MODE_HDR_BT Setting */

/**@} end of group I3C_TARG_MSGLAST_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_CTRL1 I3C_CONT_CTRL1
 * @brief    Controller Control 1 Register.
 * @{
 */
#define MXC_F_I3C_CONT_CTRL1_REQ_POS                   0 /**< CONT_CTRL1_REQ Position */
#define MXC_F_I3C_CONT_CTRL1_REQ                       ((uint32_t)(0x7UL << MXC_F_I3C_CONT_CTRL1_REQ_POS)) /**< CONT_CTRL1_REQ Mask */
#define MXC_V_I3C_CONT_CTRL1_REQ_NONE                  ((uint32_t)0x0UL) /**< CONT_CTRL1_REQ_NONE Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_NONE                  (MXC_V_I3C_CONT_CTRL1_REQ_NONE << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_NONE Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_EMIT_START            ((uint32_t)0x1UL) /**< CONT_CTRL1_REQ_EMIT_START Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_EMIT_START            (MXC_V_I3C_CONT_CTRL1_REQ_EMIT_START << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_EMIT_START Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_EMIT_STOP             ((uint32_t)0x2UL) /**< CONT_CTRL1_REQ_EMIT_STOP Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_EMIT_STOP             (MXC_V_I3C_CONT_CTRL1_REQ_EMIT_STOP << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_EMIT_STOP Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_IBI_ACKNACK           ((uint32_t)0x3UL) /**< CONT_CTRL1_REQ_IBI_ACKNACK Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_IBI_ACKNACK           (MXC_V_I3C_CONT_CTRL1_REQ_IBI_ACKNACK << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_IBI_ACKNACK Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_PROCESS_DAA           ((uint32_t)0x4UL) /**< CONT_CTRL1_REQ_PROCESS_DAA Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_PROCESS_DAA           (MXC_V_I3C_CONT_CTRL1_REQ_PROCESS_DAA << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_PROCESS_DAA Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_EXIT_RST              ((uint32_t)0x6UL) /**< CONT_CTRL1_REQ_EXIT_RST Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_EXIT_RST              (MXC_V_I3C_CONT_CTRL1_REQ_EXIT_RST << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_EXIT_RST Setting */
#define MXC_V_I3C_CONT_CTRL1_REQ_AUTO_IBI              ((uint32_t)0x7UL) /**< CONT_CTRL1_REQ_AUTO_IBI Value */
#define MXC_S_I3C_CONT_CTRL1_REQ_AUTO_IBI              (MXC_V_I3C_CONT_CTRL1_REQ_AUTO_IBI << MXC_F_I3C_CONT_CTRL1_REQ_POS) /**< CONT_CTRL1_REQ_AUTO_IBI Setting */

#define MXC_F_I3C_CONT_CTRL1_TYPE_POS                  4 /**< CONT_CTRL1_TYPE Position */
#define MXC_F_I3C_CONT_CTRL1_TYPE                      ((uint32_t)(0x3UL << MXC_F_I3C_CONT_CTRL1_TYPE_POS)) /**< CONT_CTRL1_TYPE Mask */

#define MXC_F_I3C_CONT_CTRL1_IBIRESP_POS               6 /**< CONT_CTRL1_IBIRESP Position */
#define MXC_F_I3C_CONT_CTRL1_IBIRESP                   ((uint32_t)(0x3UL << MXC_F_I3C_CONT_CTRL1_IBIRESP_POS)) /**< CONT_CTRL1_IBIRESP Mask */

#define MXC_F_I3C_CONT_CTRL1_RDWR_DIR_POS              8 /**< CONT_CTRL1_RDWR_DIR Position */
#define MXC_F_I3C_CONT_CTRL1_RDWR_DIR                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_CTRL1_RDWR_DIR_POS)) /**< CONT_CTRL1_RDWR_DIR Mask */

