analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_CONT_CTRL1_ADDR_POS                  9 /**< CONT_CTRL1_ADDR Position */
#define MXC_F_I3C_CONT_CTRL1_ADDR                      ((uint32_t)(0x7FUL << MXC_F_I3C_CONT_CTRL1_ADDR_POS)) /**< CONT_CTRL1_ADDR Mask */

#define MXC_F_I3C_CONT_CTRL1_TERM_RD_POS               16 /**< CONT_CTRL1_TERM_RD Position */
#define MXC_F_I3C_CONT_CTRL1_TERM_RD                   ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_CTRL1_TERM_RD_POS)) /**< CONT_CTRL1_TERM_RD Mask */

/**@} end of group I3C_CONT_CTRL1_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_STATUS I3C_CONT_STATUS
 * @brief    Controller Status Register.
 * @{
 */
#define MXC_F_I3C_CONT_STATUS_STATE_POS                0 /**< CONT_STATUS_STATE Position */
#define MXC_F_I3C_CONT_STATUS_STATE                    ((uint32_t)(0x7UL << MXC_F_I3C_CONT_STATUS_STATE_POS)) /**< CONT_STATUS_STATE Mask */
#define MXC_V_I3C_CONT_STATUS_STATE_IDLE               ((uint32_t)0x0UL) /**< CONT_STATUS_STATE_IDLE Value */
#define MXC_S_I3C_CONT_STATUS_STATE_IDLE               (MXC_V_I3C_CONT_STATUS_STATE_IDLE << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_IDLE Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_TARG_REQ           ((uint32_t)0x1UL) /**< CONT_STATUS_STATE_TARG_REQ Value */
#define MXC_S_I3C_CONT_STATUS_STATE_TARG_REQ           (MXC_V_I3C_CONT_STATUS_STATE_TARG_REQ << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_TARG_REQ Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_SDR_TXSDRMSG       ((uint32_t)0x2UL) /**< CONT_STATUS_STATE_SDR_TXSDRMSG Value */
#define MXC_S_I3C_CONT_STATUS_STATE_SDR_TXSDRMSG       (MXC_V_I3C_CONT_STATUS_STATE_SDR_TXSDRMSG << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_SDR_TXSDRMSG Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_SDR_NORM           ((uint32_t)0x3UL) /**< CONT_STATUS_STATE_SDR_NORM Value */
#define MXC_S_I3C_CONT_STATUS_STATE_SDR_NORM           (MXC_V_I3C_CONT_STATUS_STATE_SDR_NORM << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_SDR_NORM Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_DDR                ((uint32_t)0x4UL) /**< CONT_STATUS_STATE_DDR Value */
#define MXC_S_I3C_CONT_STATUS_STATE_DDR                (MXC_V_I3C_CONT_STATUS_STATE_DDR << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_DDR Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_DAA                ((uint32_t)0x5UL) /**< CONT_STATUS_STATE_DAA Value */
#define MXC_S_I3C_CONT_STATUS_STATE_DAA                (MXC_V_I3C_CONT_STATUS_STATE_DAA << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_DAA Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_IBI_ACKNACK        ((uint32_t)0x6UL) /**< CONT_STATUS_STATE_IBI_ACKNACK Value */
#define MXC_S_I3C_CONT_STATUS_STATE_IBI_ACKNACK        (MXC_V_I3C_CONT_STATUS_STATE_IBI_ACKNACK << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_IBI_ACKNACK Setting */
#define MXC_V_I3C_CONT_STATUS_STATE_IBI_RX             ((uint32_t)0x7UL) /**< CONT_STATUS_STATE_IBI_RX Value */
#define MXC_S_I3C_CONT_STATUS_STATE_IBI_RX             (MXC_V_I3C_CONT_STATUS_STATE_IBI_RX << MXC_F_I3C_CONT_STATUS_STATE_POS) /**< CONT_STATUS_STATE_IBI_RX Setting */

#define MXC_F_I3C_CONT_STATUS_WAIT_POS                 4 /**< CONT_STATUS_WAIT Position */
#define MXC_F_I3C_CONT_STATUS_WAIT                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_WAIT_POS)) /**< CONT_STATUS_WAIT Mask */

#define MXC_F_I3C_CONT_STATUS_NACK_POS                 5 /**< CONT_STATUS_NACK Position */
#define MXC_F_I3C_CONT_STATUS_NACK                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_NACK_POS)) /**< CONT_STATUS_NACK Mask */

#define MXC_F_I3C_CONT_STATUS_IBITYPE_POS              6 /**< CONT_STATUS_IBITYPE Position */
#define MXC_F_I3C_CONT_STATUS_IBITYPE                  ((uint32_t)(0x3UL << MXC_F_I3C_CONT_STATUS_IBITYPE_POS)) /**< CONT_STATUS_IBITYPE Mask */
#define MXC_V_I3C_CONT_STATUS_IBITYPE_NONE             ((uint32_t)0x0UL) /**< CONT_STATUS_IBITYPE_NONE Value */
#define MXC_S_I3C_CONT_STATUS_IBITYPE_NONE             (MXC_V_I3C_CONT_STATUS_IBITYPE_NONE << MXC_F_I3C_CONT_STATUS_IBITYPE_POS) /**< CONT_STATUS_IBITYPE_NONE Setting */
#define MXC_V_I3C_CONT_STATUS_IBITYPE_IBI              ((uint32_t)0x1UL) /**< CONT_STATUS_IBITYPE_IBI Value */
#define MXC_S_I3C_CONT_STATUS_IBITYPE_IBI              (MXC_V_I3C_CONT_STATUS_IBITYPE_IBI << MXC_F_I3C_CONT_STATUS_IBITYPE_POS) /**< CONT_STATUS_IBITYPE_IBI Setting */
#define MXC_V_I3C_CONT_STATUS_IBITYPE_CONT_REQ         ((uint32_t)0x2UL) /**< CONT_STATUS_IBITYPE_CONT_REQ Value */
#define MXC_S_I3C_CONT_STATUS_IBITYPE_CONT_REQ         (MXC_V_I3C_CONT_STATUS_IBITYPE_CONT_REQ << MXC_F_I3C_CONT_STATUS_IBITYPE_POS) /**< CONT_STATUS_IBITYPE_CONT_REQ Setting */
#define MXC_V_I3C_CONT_STATUS_IBITYPE_HOTJOIN_REQ      ((uint32_t)0x3UL) /**< CONT_STATUS_IBITYPE_HOTJOIN_REQ Value */
#define MXC_S_I3C_CONT_STATUS_IBITYPE_HOTJOIN_REQ      (MXC_V_I3C_CONT_STATUS_IBITYPE_HOTJOIN_REQ << MXC_F_I3C_CONT_STATUS_IBITYPE_POS) /**< CONT_STATUS_IBITYPE_HOTJOIN_REQ Setting */

#define MXC_F_I3C_CONT_STATUS_TARG_START_POS           8 /**< CONT_STATUS_TARG_START Position */
#define MXC_F_I3C_CONT_STATUS_TARG_START               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_TARG_START_POS)) /**< CONT_STATUS_TARG_START Mask */

#define MXC_F_I3C_CONT_STATUS_REQ_DONE_POS             9 /**< CONT_STATUS_REQ_DONE Position */
#define MXC_F_I3C_CONT_STATUS_REQ_DONE                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_REQ_DONE_POS)) /**< CONT_STATUS_REQ_DONE Mask */

#define MXC_F_I3C_CONT_STATUS_DONE_POS                 10 /**< CONT_STATUS_DONE Position */
#define MXC_F_I3C_CONT_STATUS_DONE                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_DONE_POS)) /**< CONT_STATUS_DONE Mask */

#define MXC_F_I3C_CONT_STATUS_RX_RDY_POS               11 /**< CONT_STATUS_RX_RDY Position */
#define MXC_F_I3C_CONT_STATUS_RX_RDY                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_RX_RDY_POS)) /**< CONT_STATUS_RX_RDY Mask */

#define MXC_F_I3C_CONT_STATUS_TX_NFULL_POS             12 /**< CONT_STATUS_TX_NFULL Position */
#define MXC_F_I3C_CONT_STATUS_TX_NFULL                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_TX_NFULL_POS)) /**< CONT_STATUS_TX_NFULL Mask */

