analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_CONT_STATUS_IBI_WON_POS              13 /**< CONT_STATUS_IBI_WON Position */
#define MXC_F_I3C_CONT_STATUS_IBI_WON                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_IBI_WON_POS)) /**< CONT_STATUS_IBI_WON Mask */

#define MXC_F_I3C_CONT_STATUS_ERRWARN_POS              15 /**< CONT_STATUS_ERRWARN Position */
#define MXC_F_I3C_CONT_STATUS_ERRWARN                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_ERRWARN_POS)) /**< CONT_STATUS_ERRWARN Mask */

#define MXC_F_I3C_CONT_STATUS_CONT_TRANS_POS           19 /**< CONT_STATUS_CONT_TRANS Position */
#define MXC_F_I3C_CONT_STATUS_CONT_TRANS               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_STATUS_CONT_TRANS_POS)) /**< CONT_STATUS_CONT_TRANS Mask */

#define MXC_F_I3C_CONT_STATUS_IBI_ADDR_POS             24 /**< CONT_STATUS_IBI_ADDR Position */
#define MXC_F_I3C_CONT_STATUS_IBI_ADDR                 ((uint32_t)(0x7FUL << MXC_F_I3C_CONT_STATUS_IBI_ADDR_POS)) /**< CONT_STATUS_IBI_ADDR Mask */

/**@} end of group I3C_CONT_STATUS_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_IBIRULES I3C_CONT_IBIRULES
 * @brief    Controller IBI Registry and Rules Register.
 * @{
 */
#define MXC_F_I3C_CONT_IBIRULES_ADDR0_POS              0 /**< CONT_IBIRULES_ADDR0 Position */
#define MXC_F_I3C_CONT_IBIRULES_ADDR0                  ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_IBIRULES_ADDR0_POS)) /**< CONT_IBIRULES_ADDR0 Mask */

#define MXC_F_I3C_CONT_IBIRULES_ADDR1_POS              6 /**< CONT_IBIRULES_ADDR1 Position */
#define MXC_F_I3C_CONT_IBIRULES_ADDR1                  ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_IBIRULES_ADDR1_POS)) /**< CONT_IBIRULES_ADDR1 Mask */

#define MXC_F_I3C_CONT_IBIRULES_ADDR2_POS              12 /**< CONT_IBIRULES_ADDR2 Position */
#define MXC_F_I3C_CONT_IBIRULES_ADDR2                  ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_IBIRULES_ADDR2_POS)) /**< CONT_IBIRULES_ADDR2 Mask */

#define MXC_F_I3C_CONT_IBIRULES_ADDR3_POS              18 /**< CONT_IBIRULES_ADDR3 Position */
#define MXC_F_I3C_CONT_IBIRULES_ADDR3                  ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_IBIRULES_ADDR3_POS)) /**< CONT_IBIRULES_ADDR3 Mask */

#define MXC_F_I3C_CONT_IBIRULES_ADDR4_POS              24 /**< CONT_IBIRULES_ADDR4 Position */
#define MXC_F_I3C_CONT_IBIRULES_ADDR4                  ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_IBIRULES_ADDR4_POS)) /**< CONT_IBIRULES_ADDR4 Mask */

#define MXC_F_I3C_CONT_IBIRULES_MSB0_POS               30 /**< CONT_IBIRULES_MSB0 Position */
#define MXC_F_I3C_CONT_IBIRULES_MSB0                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_IBIRULES_MSB0_POS)) /**< CONT_IBIRULES_MSB0 Mask */

#define MXC_F_I3C_CONT_IBIRULES_NOBYTE_POS             31 /**< CONT_IBIRULES_NOBYTE Position */
#define MXC_F_I3C_CONT_IBIRULES_NOBYTE                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_IBIRULES_NOBYTE_POS)) /**< CONT_IBIRULES_NOBYTE Mask */

/**@} end of group I3C_CONT_IBIRULES_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_INTEN I3C_CONT_INTEN
 * @brief    Controller Interrupt Enable Register.
 * @{
 */
#define MXC_F_I3C_CONT_INTEN_TARG_START_POS            8 /**< CONT_INTEN_TARG_START Position */
#define MXC_F_I3C_CONT_INTEN_TARG_START                ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_TARG_START_POS)) /**< CONT_INTEN_TARG_START Mask */

#define MXC_F_I3C_CONT_INTEN_REQ_DONE_POS              9 /**< CONT_INTEN_REQ_DONE Position */
#define MXC_F_I3C_CONT_INTEN_REQ_DONE                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_REQ_DONE_POS)) /**< CONT_INTEN_REQ_DONE Mask */

#define MXC_F_I3C_CONT_INTEN_DONE_POS                  10 /**< CONT_INTEN_DONE Position */
#define MXC_F_I3C_CONT_INTEN_DONE                      ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_DONE_POS)) /**< CONT_INTEN_DONE Mask */

#define MXC_F_I3C_CONT_INTEN_RX_RDY_POS                11 /**< CONT_INTEN_RX_RDY Position */
#define MXC_F_I3C_CONT_INTEN_RX_RDY                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_RX_RDY_POS)) /**< CONT_INTEN_RX_RDY Mask */

#define MXC_F_I3C_CONT_INTEN_TX_NFULL_POS              12 /**< CONT_INTEN_TX_NFULL Position */
#define MXC_F_I3C_CONT_INTEN_TX_NFULL                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_TX_NFULL_POS)) /**< CONT_INTEN_TX_NFULL Mask */

#define MXC_F_I3C_CONT_INTEN_IBI_WON_POS               13 /**< CONT_INTEN_IBI_WON Position */
#define MXC_F_I3C_CONT_INTEN_IBI_WON                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_IBI_WON_POS)) /**< CONT_INTEN_IBI_WON Mask */

#define MXC_F_I3C_CONT_INTEN_ERRWARN_POS               15 /**< CONT_INTEN_ERRWARN Position */
#define MXC_F_I3C_CONT_INTEN_ERRWARN                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_ERRWARN_POS)) /**< CONT_INTEN_ERRWARN Mask */

#define MXC_F_I3C_CONT_INTEN_NOW_CONT_POS              19 /**< CONT_INTEN_NOW_CONT Position */
#define MXC_F_I3C_CONT_INTEN_NOW_CONT                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTEN_NOW_CONT_POS)) /**< CONT_INTEN_NOW_CONT Mask */

/**@} end of group I3C_CONT_INTEN_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_INTCLR I3C_CONT_INTCLR
 * @brief    Controller Interrupt Clear Register.
 * @{
 */
#define MXC_F_I3C_CONT_INTCLR_TARG_START_POS           8 /**< CONT_INTCLR_TARG_START Position */
#define MXC_F_I3C_CONT_INTCLR_TARG_START               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_TARG_START_POS)) /**< CONT_INTCLR_TARG_START Mask */

#define MXC_F_I3C_CONT_INTCLR_REQ_DONE_POS             9 /**< CONT_INTCLR_REQ_DONE Position */
#define MXC_F_I3C_CONT_INTCLR_REQ_DONE                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_REQ_DONE_POS)) /**< CONT_INTCLR_REQ_DONE Mask */

#define MXC_F_I3C_CONT_INTCLR_DONE_POS                 10 /**< CONT_INTCLR_DONE Position */
#define MXC_F_I3C_CONT_INTCLR_DONE                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_DONE_POS)) /**< CONT_INTCLR_DONE Mask */

#define MXC_F_I3C_CONT_INTCLR_RX_RDY_POS               11 /**< CONT_INTCLR_RX_RDY Position */
#define MXC_F_I3C_CONT_INTCLR_RX_RDY                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_RX_RDY_POS)) /**< CONT_INTCLR_RX_RDY Mask */

#define MXC_F_I3C_CONT_INTCLR_TX_NFULL_POS             12 /**< CONT_INTCLR_TX_NFULL Position */
#define MXC_F_I3C_CONT_INTCLR_TX_NFULL                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_TX_NFULL_POS)) /**< CONT_INTCLR_TX_NFULL Mask */

#define MXC_F_I3C_CONT_INTCLR_IBI_WON_POS              13 /**< CONT_INTCLR_IBI_WON Position */
#define MXC_F_I3C_CONT_INTCLR_IBI_WON                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_IBI_WON_POS)) /**< CONT_INTCLR_IBI_WON Mask */

#define MXC_F_I3C_CONT_INTCLR_ERRWARN_POS              15 /**< CONT_INTCLR_ERRWARN Position */
#define MXC_F_I3C_CONT_INTCLR_ERRWARN                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_ERRWARN_POS)) /**< CONT_INTCLR_ERRWARN Mask */

#define MXC_F_I3C_CONT_INTCLR_NOW_CONT_POS             19 /**< CONT_INTCLR_NOW_CONT Position */
#define MXC_F_I3C_CONT_INTCLR_NOW_CONT                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTCLR_NOW_CONT_POS)) /**< CONT_INTCLR_NOW_CONT Mask */

/**@} end of group I3C_CONT_INTCLR_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_INTFL I3C_CONT_INTFL
 * @brief    Controller Interrupt Flag Register.
 * @{
 */
#define MXC_F_I3C_CONT_INTFL_TARG_START_POS            8 /**< CONT_INTFL_TARG_START Position */
#define MXC_F_I3C_CONT_INTFL_TARG_START                ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_TARG_START_POS)) /**< CONT_INTFL_TARG_START Mask */

#define MXC_F_I3C_CONT_INTFL_REQ_DONE_POS              9 /**< CONT_INTFL_REQ_DONE Position */
#define MXC_F_I3C_CONT_INTFL_REQ_DONE                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_REQ_DONE_POS)) /**< CONT_INTFL_REQ_DONE Mask */

#define MXC_F_I3C_CONT_INTFL_DONE_POS                  10 /**< CONT_INTFL_DONE Position */
#define MXC_F_I3C_CONT_INTFL_DONE                      ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_DONE_POS)) /**< CONT_INTFL_DONE Mask */

#define MXC_F_I3C_CONT_INTFL_RX_RDY_POS                11 /**< CONT_INTFL_RX_RDY Position */
#define MXC_F_I3C_CONT_INTFL_RX_RDY                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_RX_RDY_POS)) /**< CONT_INTFL_RX_RDY Mask */

#define MXC_F_I3C_CONT_INTFL_TX_NFULL_POS              12 /**< CONT_INTFL_TX_NFULL Position */
#define MXC_F_I3C_CONT_INTFL_TX_NFULL                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_TX_NFULL_POS)) /**< CONT_INTFL_TX_NFULL Mask */

