analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_CONT_INTFL_IBI_WON_POS               13 /**< CONT_INTFL_IBI_WON Position */
#define MXC_F_I3C_CONT_INTFL_IBI_WON                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_IBI_WON_POS)) /**< CONT_INTFL_IBI_WON Mask */

#define MXC_F_I3C_CONT_INTFL_ERRWARN_POS               15 /**< CONT_INTFL_ERRWARN Position */
#define MXC_F_I3C_CONT_INTFL_ERRWARN                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_ERRWARN_POS)) /**< CONT_INTFL_ERRWARN Mask */

#define MXC_F_I3C_CONT_INTFL_NOW_CONT_POS              19 /**< CONT_INTFL_NOW_CONT Position */
#define MXC_F_I3C_CONT_INTFL_NOW_CONT                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_INTFL_NOW_CONT_POS)) /**< CONT_INTFL_NOW_CONT Mask */

/**@} end of group I3C_CONT_INTFL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_ERRWARN I3C_CONT_ERRWARN
 * @brief    Controller Error and Warning Register.
 * @{
 */
#define MXC_F_I3C_CONT_ERRWARN_NACK_POS                2 /**< CONT_ERRWARN_NACK Position */
#define MXC_F_I3C_CONT_ERRWARN_NACK                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_NACK_POS)) /**< CONT_ERRWARN_NACK Mask */

#define MXC_F_I3C_CONT_ERRWARN_TX_ABT_POS              3 /**< CONT_ERRWARN_TX_ABT Position */
#define MXC_F_I3C_CONT_ERRWARN_TX_ABT                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_TX_ABT_POS)) /**< CONT_ERRWARN_TX_ABT Mask */

#define MXC_F_I3C_CONT_ERRWARN_RX_TERM_POS             4 /**< CONT_ERRWARN_RX_TERM Position */
#define MXC_F_I3C_CONT_ERRWARN_RX_TERM                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_RX_TERM_POS)) /**< CONT_ERRWARN_RX_TERM Mask */

#define MXC_F_I3C_CONT_ERRWARN_HDR_PAR_POS             9 /**< CONT_ERRWARN_HDR_PAR Position */
#define MXC_F_I3C_CONT_ERRWARN_HDR_PAR                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_HDR_PAR_POS)) /**< CONT_ERRWARN_HDR_PAR Mask */

#define MXC_F_I3C_CONT_ERRWARN_HDR_CRC_POS             10 /**< CONT_ERRWARN_HDR_CRC Position */
#define MXC_F_I3C_CONT_ERRWARN_HDR_CRC                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_HDR_CRC_POS)) /**< CONT_ERRWARN_HDR_CRC Mask */

#define MXC_F_I3C_CONT_ERRWARN_RX_UNR_POS              16 /**< CONT_ERRWARN_RX_UNR Position */
#define MXC_F_I3C_CONT_ERRWARN_RX_UNR                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_RX_UNR_POS)) /**< CONT_ERRWARN_RX_UNR Mask */

#define MXC_F_I3C_CONT_ERRWARN_TX_OVR_POS              17 /**< CONT_ERRWARN_TX_OVR Position */
#define MXC_F_I3C_CONT_ERRWARN_TX_OVR                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_TX_OVR_POS)) /**< CONT_ERRWARN_TX_OVR Mask */

#define MXC_F_I3C_CONT_ERRWARN_MSG_POS                 18 /**< CONT_ERRWARN_MSG Position */
#define MXC_F_I3C_CONT_ERRWARN_MSG                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_MSG_POS)) /**< CONT_ERRWARN_MSG Mask */

#define MXC_F_I3C_CONT_ERRWARN_INV_REQ_POS             19 /**< CONT_ERRWARN_INV_REQ Position */
#define MXC_F_I3C_CONT_ERRWARN_INV_REQ                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_INV_REQ_POS)) /**< CONT_ERRWARN_INV_REQ Mask */

#define MXC_F_I3C_CONT_ERRWARN_TO_POS                  20 /**< CONT_ERRWARN_TO Position */
#define MXC_F_I3C_CONT_ERRWARN_TO                      ((uint32_t)(0x1UL << MXC_F_I3C_CONT_ERRWARN_TO_POS)) /**< CONT_ERRWARN_TO Mask */

/**@} end of group I3C_CONT_ERRWARN_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_DMACTRL I3C_CONT_DMACTRL
 * @brief    Controller DMA Control Register.
 * @{
 */
#define MXC_F_I3C_CONT_DMACTRL_RX_EN_POS               0 /**< CONT_DMACTRL_RX_EN Position */
#define MXC_F_I3C_CONT_DMACTRL_RX_EN                   ((uint32_t)(0x3UL << MXC_F_I3C_CONT_DMACTRL_RX_EN_POS)) /**< CONT_DMACTRL_RX_EN Mask */
#define MXC_V_I3C_CONT_DMACTRL_RX_EN_DIS               ((uint32_t)0x0UL) /**< CONT_DMACTRL_RX_EN_DIS Value */
#define MXC_S_I3C_CONT_DMACTRL_RX_EN_DIS               (MXC_V_I3C_CONT_DMACTRL_RX_EN_DIS << MXC_F_I3C_CONT_DMACTRL_RX_EN_POS) /**< CONT_DMACTRL_RX_EN_DIS Setting */
#define MXC_V_I3C_CONT_DMACTRL_RX_EN_ONE_FR            ((uint32_t)0x1UL) /**< CONT_DMACTRL_RX_EN_ONE_FR Value */
#define MXC_S_I3C_CONT_DMACTRL_RX_EN_ONE_FR            (MXC_V_I3C_CONT_DMACTRL_RX_EN_ONE_FR << MXC_F_I3C_CONT_DMACTRL_RX_EN_POS) /**< CONT_DMACTRL_RX_EN_ONE_FR Setting */
#define MXC_V_I3C_CONT_DMACTRL_RX_EN_EN                ((uint32_t)0x2UL) /**< CONT_DMACTRL_RX_EN_EN Value */
#define MXC_S_I3C_CONT_DMACTRL_RX_EN_EN                (MXC_V_I3C_CONT_DMACTRL_RX_EN_EN << MXC_F_I3C_CONT_DMACTRL_RX_EN_POS) /**< CONT_DMACTRL_RX_EN_EN Setting */

#define MXC_F_I3C_CONT_DMACTRL_TX_EN_POS               2 /**< CONT_DMACTRL_TX_EN Position */
#define MXC_F_I3C_CONT_DMACTRL_TX_EN                   ((uint32_t)(0x3UL << MXC_F_I3C_CONT_DMACTRL_TX_EN_POS)) /**< CONT_DMACTRL_TX_EN Mask */
#define MXC_V_I3C_CONT_DMACTRL_TX_EN_DIS               ((uint32_t)0x0UL) /**< CONT_DMACTRL_TX_EN_DIS Value */
#define MXC_S_I3C_CONT_DMACTRL_TX_EN_DIS               (MXC_V_I3C_CONT_DMACTRL_TX_EN_DIS << MXC_F_I3C_CONT_DMACTRL_TX_EN_POS) /**< CONT_DMACTRL_TX_EN_DIS Setting */
#define MXC_V_I3C_CONT_DMACTRL_TX_EN_ONE_FR            ((uint32_t)0x1UL) /**< CONT_DMACTRL_TX_EN_ONE_FR Value */
#define MXC_S_I3C_CONT_DMACTRL_TX_EN_ONE_FR            (MXC_V_I3C_CONT_DMACTRL_TX_EN_ONE_FR << MXC_F_I3C_CONT_DMACTRL_TX_EN_POS) /**< CONT_DMACTRL_TX_EN_ONE_FR Setting */
#define MXC_V_I3C_CONT_DMACTRL_TX_EN_EN                ((uint32_t)0x2UL) /**< CONT_DMACTRL_TX_EN_EN Value */
#define MXC_S_I3C_CONT_DMACTRL_TX_EN_EN                (MXC_V_I3C_CONT_DMACTRL_TX_EN_EN << MXC_F_I3C_CONT_DMACTRL_TX_EN_POS) /**< CONT_DMACTRL_TX_EN_EN Setting */

#define MXC_F_I3C_CONT_DMACTRL_WIDTH_POS               4 /**< CONT_DMACTRL_WIDTH Position */
#define MXC_F_I3C_CONT_DMACTRL_WIDTH                   ((uint32_t)(0x3UL << MXC_F_I3C_CONT_DMACTRL_WIDTH_POS)) /**< CONT_DMACTRL_WIDTH Mask */
#define MXC_V_I3C_CONT_DMACTRL_WIDTH_BYTE              ((uint32_t)0x0UL) /**< CONT_DMACTRL_WIDTH_BYTE Value */
#define MXC_S_I3C_CONT_DMACTRL_WIDTH_BYTE              (MXC_V_I3C_CONT_DMACTRL_WIDTH_BYTE << MXC_F_I3C_CONT_DMACTRL_WIDTH_POS) /**< CONT_DMACTRL_WIDTH_BYTE Setting */
#define MXC_V_I3C_CONT_DMACTRL_WIDTH_HALFWORD          ((uint32_t)0x2UL) /**< CONT_DMACTRL_WIDTH_HALFWORD Value */
#define MXC_S_I3C_CONT_DMACTRL_WIDTH_HALFWORD          (MXC_V_I3C_CONT_DMACTRL_WIDTH_HALFWORD << MXC_F_I3C_CONT_DMACTRL_WIDTH_POS) /**< CONT_DMACTRL_WIDTH_HALFWORD Setting */

/**@} end of group I3C_CONT_DMACTRL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_FIFOCTRL I3C_CONT_FIFOCTRL
 * @brief    Controller FIFO Control Register.
 * @{
 */
#define MXC_F_I3C_CONT_FIFOCTRL_TX_FLUSH_POS           0 /**< CONT_FIFOCTRL_TX_FLUSH Position */
#define MXC_F_I3C_CONT_FIFOCTRL_TX_FLUSH               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_FIFOCTRL_TX_FLUSH_POS)) /**< CONT_FIFOCTRL_TX_FLUSH Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_RX_FLUSH_POS           1 /**< CONT_FIFOCTRL_RX_FLUSH Position */
#define MXC_F_I3C_CONT_FIFOCTRL_RX_FLUSH               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_FIFOCTRL_RX_FLUSH_POS)) /**< CONT_FIFOCTRL_RX_FLUSH Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_UNLOCK_POS             3 /**< CONT_FIFOCTRL_UNLOCK Position */
#define MXC_F_I3C_CONT_FIFOCTRL_UNLOCK                 ((uint32_t)(0x1UL << MXC_F_I3C_CONT_FIFOCTRL_UNLOCK_POS)) /**< CONT_FIFOCTRL_UNLOCK Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS         4 /**< CONT_FIFOCTRL_TX_THD_LVL Position */
#define MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL             ((uint32_t)(0x3UL << MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS)) /**< CONT_FIFOCTRL_TX_THD_LVL Mask */
#define MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_EMPTY       ((uint32_t)0x0UL) /**< CONT_FIFOCTRL_TX_THD_LVL_EMPTY Value */
#define MXC_S_I3C_CONT_FIFOCTRL_TX_THD_LVL_EMPTY       (MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_EMPTY << MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS) /**< CONT_FIFOCTRL_TX_THD_LVL_EMPTY Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_QUARTER_FULL ((uint32_t)0x1UL) /**< CONT_FIFOCTRL_TX_THD_LVL_QUARTER_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_TX_THD_LVL_QUARTER_FULL (MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_QUARTER_FULL << MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS) /**< CONT_FIFOCTRL_TX_THD_LVL_QUARTER_FULL Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_HALF_FULL   ((uint32_t)0x2UL) /**< CONT_FIFOCTRL_TX_THD_LVL_HALF_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_TX_THD_LVL_HALF_FULL   (MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_HALF_FULL << MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS) /**< CONT_FIFOCTRL_TX_THD_LVL_HALF_FULL Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_ALMOST_FULL ((uint32_t)0x3UL) /**< CONT_FIFOCTRL_TX_THD_LVL_ALMOST_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_TX_THD_LVL_ALMOST_FULL (MXC_V_I3C_CONT_FIFOCTRL_TX_THD_LVL_ALMOST_FULL << MXC_F_I3C_CONT_FIFOCTRL_TX_THD_LVL_POS) /**< CONT_FIFOCTRL_TX_THD_LVL_ALMOST_FULL Setting */

#define MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS         6 /**< CONT_FIFOCTRL_RX_THD_LVL Position */
#define MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL             ((uint32_t)(0x3UL << MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS)) /**< CONT_FIFOCTRL_RX_THD_LVL Mask */
#define MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_NOT_EMPTY   ((uint32_t)0x0UL) /**< CONT_FIFOCTRL_RX_THD_LVL_NOT_EMPTY Value */
#define MXC_S_I3C_CONT_FIFOCTRL_RX_THD_LVL_NOT_EMPTY   (MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_NOT_EMPTY << MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS) /**< CONT_FIFOCTRL_RX_THD_LVL_NOT_EMPTY Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_QUARTER_FULL ((uint32_t)0x1UL) /**< CONT_FIFOCTRL_RX_THD_LVL_QUARTER_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_RX_THD_LVL_QUARTER_FULL (MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_QUARTER_FULL << MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS) /**< CONT_FIFOCTRL_RX_THD_LVL_QUARTER_FULL Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_HALF_FULL   ((uint32_t)0x2UL) /**< CONT_FIFOCTRL_RX_THD_LVL_HALF_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_RX_THD_LVL_HALF_FULL   (MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_HALF_FULL << MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS) /**< CONT_FIFOCTRL_RX_THD_LVL_HALF_FULL Setting */
#define MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL ((uint32_t)0x3UL) /**< CONT_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL Value */
#define MXC_S_I3C_CONT_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL (MXC_V_I3C_CONT_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL << MXC_F_I3C_CONT_FIFOCTRL_RX_THD_LVL_POS) /**< CONT_FIFOCTRL_RX_THD_LVL_3_QUARTER_FULL Setting */

