analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_CONT_FIFOCTRL_TX_LVL_POS             16 /**< CONT_FIFOCTRL_TX_LVL Position */
#define MXC_F_I3C_CONT_FIFOCTRL_TX_LVL                 ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_FIFOCTRL_TX_LVL_POS)) /**< CONT_FIFOCTRL_TX_LVL Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_RX_LVL_POS             24 /**< CONT_FIFOCTRL_RX_LVL Position */
#define MXC_F_I3C_CONT_FIFOCTRL_RX_LVL                 ((uint32_t)(0x3FUL << MXC_F_I3C_CONT_FIFOCTRL_RX_LVL_POS)) /**< CONT_FIFOCTRL_RX_LVL Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_TX_FULL_POS            30 /**< CONT_FIFOCTRL_TX_FULL Position */
#define MXC_F_I3C_CONT_FIFOCTRL_TX_FULL                ((uint32_t)(0x1UL << MXC_F_I3C_CONT_FIFOCTRL_TX_FULL_POS)) /**< CONT_FIFOCTRL_TX_FULL Mask */

#define MXC_F_I3C_CONT_FIFOCTRL_RX_EM_POS              31 /**< CONT_FIFOCTRL_RX_EM Position */
#define MXC_F_I3C_CONT_FIFOCTRL_RX_EM                  ((uint32_t)(0x1UL << MXC_F_I3C_CONT_FIFOCTRL_RX_EM_POS)) /**< CONT_FIFOCTRL_RX_EM Mask */

/**@} end of group I3C_CONT_FIFOCTRL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXFIFO8 I3C_CONT_TXFIFO8
 * @brief    Controller Write Byte Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXFIFO8_DATA_POS                0 /**< CONT_TXFIFO8_DATA Position */
#define MXC_F_I3C_CONT_TXFIFO8_DATA                    ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_TXFIFO8_DATA_POS)) /**< CONT_TXFIFO8_DATA Mask */

#define MXC_F_I3C_CONT_TXFIFO8_END_POS                 8 /**< CONT_TXFIFO8_END Position */
#define MXC_F_I3C_CONT_TXFIFO8_END                     ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXFIFO8_END_POS)) /**< CONT_TXFIFO8_END Mask */

#define MXC_F_I3C_CONT_TXFIFO8_END2_POS                16 /**< CONT_TXFIFO8_END2 Position */
#define MXC_F_I3C_CONT_TXFIFO8_END2                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXFIFO8_END2_POS)) /**< CONT_TXFIFO8_END2 Mask */

/**@} end of group I3C_CONT_TXFIFO8_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXFIFO8E I3C_CONT_TXFIFO8E
 * @brief    Controller Write Byte Data as End Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXFIFO8E_DATA_POS               0 /**< CONT_TXFIFO8E_DATA Position */
#define MXC_F_I3C_CONT_TXFIFO8E_DATA                   ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_TXFIFO8E_DATA_POS)) /**< CONT_TXFIFO8E_DATA Mask */

/**@} end of group I3C_CONT_TXFIFO8E_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXFIFO16 I3C_CONT_TXFIFO16
 * @brief    Controller Write Half-Word Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXFIFO16_DATA_POS               0 /**< CONT_TXFIFO16_DATA Position */
#define MXC_F_I3C_CONT_TXFIFO16_DATA                   ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_TXFIFO16_DATA_POS)) /**< CONT_TXFIFO16_DATA Mask */

#define MXC_F_I3C_CONT_TXFIFO16_END_POS                16 /**< CONT_TXFIFO16_END Position */
#define MXC_F_I3C_CONT_TXFIFO16_END                    ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXFIFO16_END_POS)) /**< CONT_TXFIFO16_END Mask */

/**@} end of group I3C_CONT_TXFIFO16_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXFIFO16E I3C_CONT_TXFIFO16E
 * @brief    Controller Write Half-Word Data as End Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXFIFO16E_DATA_POS              0 /**< CONT_TXFIFO16E_DATA Position */
#define MXC_F_I3C_CONT_TXFIFO16E_DATA                  ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_TXFIFO16E_DATA_POS)) /**< CONT_TXFIFO16E_DATA Mask */

/**@} end of group I3C_CONT_TXFIFO16E_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_RXFIFO8 I3C_CONT_RXFIFO8
 * @brief    Controller Read Byte Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_RXFIFO8_DATA_POS                0 /**< CONT_RXFIFO8_DATA Position */
#define MXC_F_I3C_CONT_RXFIFO8_DATA                    ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_RXFIFO8_DATA_POS)) /**< CONT_RXFIFO8_DATA Mask */

/**@} end of group I3C_CONT_RXFIFO8_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_RXFIFO16 I3C_CONT_RXFIFO16
 * @brief    Controller Read Half-Word Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_RXFIFO16_DATA_POS               0 /**< CONT_RXFIFO16_DATA Position */
#define MXC_F_I3C_CONT_RXFIFO16_DATA                   ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_RXFIFO16_DATA_POS)) /**< CONT_RXFIFO16_DATA Mask */

/**@} end of group I3C_CONT_RXFIFO16_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXFIFO8O I3C_CONT_TXFIFO8O
 * @brief    Controller Byte-Only Write Byte Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXFIFO8O_DATA_POS               0 /**< CONT_TXFIFO8O_DATA Position */
#define MXC_F_I3C_CONT_TXFIFO8O_DATA                   ((uint32_t)(0xFFUL << MXC_F_I3C_CONT_TXFIFO8O_DATA_POS)) /**< CONT_TXFIFO8O_DATA Mask */

/**@} end of group I3C_CONT_TXFIFO8O_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXSDRMSG_CTRL I3C_CONT_TXSDRMSG_CTRL
 * @brief    Controller Start or Continue SDR Message Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_RDWR_DIR_POS      0 /**< CONT_TXSDRMSG_CTRL_RDWR_DIR Position */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_RDWR_DIR          ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXSDRMSG_CTRL_RDWR_DIR_POS)) /**< CONT_TXSDRMSG_CTRL_RDWR_DIR Mask */

#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_ADDR_POS          1 /**< CONT_TXSDRMSG_CTRL_ADDR Position */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_ADDR              ((uint32_t)(0x7FUL << MXC_F_I3C_CONT_TXSDRMSG_CTRL_ADDR_POS)) /**< CONT_TXSDRMSG_CTRL_ADDR Mask */

#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_END_POS           8 /**< CONT_TXSDRMSG_CTRL_END Position */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_END               ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXSDRMSG_CTRL_END_POS)) /**< CONT_TXSDRMSG_CTRL_END Mask */

#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_I2C_EN_POS        10 /**< CONT_TXSDRMSG_CTRL_I2C_EN Position */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_I2C_EN            ((uint32_t)(0x1UL << MXC_F_I3C_CONT_TXSDRMSG_CTRL_I2C_EN_POS)) /**< CONT_TXSDRMSG_CTRL_I2C_EN Mask */

#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_LEN_POS           11 /**< CONT_TXSDRMSG_CTRL_LEN Position */
#define MXC_F_I3C_CONT_TXSDRMSG_CTRL_LEN               ((uint32_t)(0x1FUL << MXC_F_I3C_CONT_TXSDRMSG_CTRL_LEN_POS)) /**< CONT_TXSDRMSG_CTRL_LEN Mask */

/**@} end of group I3C_CONT_TXSDRMSG_CTRL_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXSDRMSG_FIFO I3C_CONT_TXSDRMSG_FIFO
 * @brief    Controller Start or Continue SDR Message Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXSDRMSG_FIFO_DATA_POS          0 /**< CONT_TXSDRMSG_FIFO_DATA Position */
#define MXC_F_I3C_CONT_TXSDRMSG_FIFO_DATA              ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_TXSDRMSG_FIFO_DATA_POS)) /**< CONT_TXSDRMSG_FIFO_DATA Mask */

/**@} end of group I3C_CONT_TXSDRMSG_FIFO_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_RXSDRMSG I3C_CONT_RXSDRMSG
 * @brief    Controller Read SDR Message Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_RXSDRMSG_DATA_POS               0 /**< CONT_RXSDRMSG_DATA Position */
#define MXC_F_I3C_CONT_RXSDRMSG_DATA                   ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_RXSDRMSG_DATA_POS)) /**< CONT_RXSDRMSG_DATA Mask */

/**@} end of group I3C_CONT_RXSDRMSG_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_TXDDRMSG I3C_CONT_TXDDRMSG
 * @brief    Controller Start or Continue DDR Message Register.
 * @{
 */
#define MXC_F_I3C_CONT_TXDDRMSG_MSG_POS                0 /**< CONT_TXDDRMSG_MSG Position */
#define MXC_F_I3C_CONT_TXDDRMSG_MSG                    ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_TXDDRMSG_MSG_POS)) /**< CONT_TXDDRMSG_MSG Mask */

/**@} end of group I3C_CONT_TXDDRMSG_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_RXDDR16 I3C_CONT_RXDDR16
 * @brief    Controller Read DDR Message Data Register.
 * @{
 */
#define MXC_F_I3C_CONT_RXDDR16_DATA_POS                0 /**< CONT_RXDDR16_DATA Position */
#define MXC_F_I3C_CONT_RXDDR16_DATA                    ((uint32_t)(0xFFFFUL << MXC_F_I3C_CONT_RXDDR16_DATA_POS)) /**< CONT_RXDDR16_DATA Mask */

/**@} end of group I3C_CONT_RXDDR16_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_CONT_DYNADDR I3C_CONT_DYNADDR
 * @brief    Controller Dynamic Address Register.
 * @{
 */
#define MXC_F_I3C_CONT_DYNADDR_ADDR_POS                1 /**< CONT_DYNADDR_ADDR Position */
#define MXC_F_I3C_CONT_DYNADDR_ADDR                    ((uint32_t)(0x7FUL << MXC_F_I3C_CONT_DYNADDR_ADDR_POS)) /**< CONT_DYNADDR_ADDR Mask */

#define MXC_F_I3C_CONT_DYNADDR_VALID_POS               8 /**< CONT_DYNADDR_VALID Position */
#define MXC_F_I3C_CONT_DYNADDR_VALID                   ((uint32_t)(0x1UL << MXC_F_I3C_CONT_DYNADDR_VALID_POS)) /**< CONT_DYNADDR_VALID Mask */

/**@} end of group I3C_CONT_DYNADDR_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_GROUPDEF I3C_TARG_GROUPDEF
 * @brief    Target Group Definition Register.
 * @{
 */
#define MXC_F_I3C_TARG_GROUPDEF_ADDR_EN_POS            0 /**< TARG_GROUPDEF_ADDR_EN Position */
#define MXC_F_I3C_TARG_GROUPDEF_ADDR_EN                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_GROUPDEF_ADDR_EN_POS)) /**< TARG_GROUPDEF_ADDR_EN Mask */

