analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/i3c_regs.h
#define MXC_F_I3C_TARG_GROUPDEF_ADDR_POS               1 /**< TARG_GROUPDEF_ADDR Position */
#define MXC_F_I3C_TARG_GROUPDEF_ADDR                   ((uint32_t)(0x7FUL << MXC_F_I3C_TARG_GROUPDEF_ADDR_POS)) /**< TARG_GROUPDEF_ADDR Mask */

/**@} end of group I3C_TARG_GROUPDEF_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_MAPCTRL0 I3C_TARG_MAPCTRL0
 * @brief    Target Primary Map Control Register.
 * @{
 */
#define MXC_F_I3C_TARG_MAPCTRL0_DYNADDR_EN_POS         0 /**< TARG_MAPCTRL0_DYNADDR_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL0_DYNADDR_EN             ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL0_DYNADDR_EN_POS)) /**< TARG_MAPCTRL0_DYNADDR_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL0_DYNADDR_POS            1 /**< TARG_MAPCTRL0_DYNADDR Position */
#define MXC_F_I3C_TARG_MAPCTRL0_DYNADDR                ((uint32_t)(0x7FUL << MXC_F_I3C_TARG_MAPCTRL0_DYNADDR_POS)) /**< TARG_MAPCTRL0_DYNADDR Mask */

#define MXC_F_I3C_TARG_MAPCTRL0_CAUSE_POS              8 /**< TARG_MAPCTRL0_CAUSE Position */
#define MXC_F_I3C_TARG_MAPCTRL0_CAUSE                  ((uint32_t)(0x7UL << MXC_F_I3C_TARG_MAPCTRL0_CAUSE_POS)) /**< TARG_MAPCTRL0_CAUSE Mask */

/**@} end of group I3C_TARG_MAPCTRL0_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_MAPCTRL1 I3C_TARG_MAPCTRL1
 * @brief    Target Map Control 1 Register.
 * @{
 */
#define MXC_F_I3C_TARG_MAPCTRL1_EN_POS                 0 /**< TARG_MAPCTRL1_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL1_EN                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL1_EN_POS)) /**< TARG_MAPCTRL1_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL1_ADDR_POS               1 /**< TARG_MAPCTRL1_ADDR Position */
#define MXC_F_I3C_TARG_MAPCTRL1_ADDR                   ((uint32_t)(0x7FUL << MXC_F_I3C_TARG_MAPCTRL1_ADDR_POS)) /**< TARG_MAPCTRL1_ADDR Mask */

#define MXC_F_I3C_TARG_MAPCTRL1_STATADDR_EN_POS        8 /**< TARG_MAPCTRL1_STATADDR_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL1_STATADDR_EN            ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL1_STATADDR_EN_POS)) /**< TARG_MAPCTRL1_STATADDR_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL1_STATADDR_10B_POS       9 /**< TARG_MAPCTRL1_STATADDR_10B Position */
#define MXC_F_I3C_TARG_MAPCTRL1_STATADDR_10B           ((uint32_t)(0x7UL << MXC_F_I3C_TARG_MAPCTRL1_STATADDR_10B_POS)) /**< TARG_MAPCTRL1_STATADDR_10B Mask */

#define MXC_F_I3C_TARG_MAPCTRL1_NACK_POS               12 /**< TARG_MAPCTRL1_NACK Position */
#define MXC_F_I3C_TARG_MAPCTRL1_NACK                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL1_NACK_POS)) /**< TARG_MAPCTRL1_NACK Mask */

/**@} end of group I3C_TARG_MAPCTRL1_Register */

/**
 * @ingroup  i3c_registers
 * @defgroup I3C_TARG_MAPCTRL2 I3C_TARG_MAPCTRL2
 * @brief    Target Map Control 2 Register.
 * @{
 */
#define MXC_F_I3C_TARG_MAPCTRL2_EN_POS                 0 /**< TARG_MAPCTRL2_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL2_EN                     ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL2_EN_POS)) /**< TARG_MAPCTRL2_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL2_ADDR_POS               1 /**< TARG_MAPCTRL2_ADDR Position */
#define MXC_F_I3C_TARG_MAPCTRL2_ADDR                   ((uint32_t)(0x7FUL << MXC_F_I3C_TARG_MAPCTRL2_ADDR_POS)) /**< TARG_MAPCTRL2_ADDR Mask */

#define MXC_F_I3C_TARG_MAPCTRL2_STATADDR_EN_POS        8 /**< TARG_MAPCTRL2_STATADDR_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL2_STATADDR_EN            ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL2_STATADDR_EN_POS)) /**< TARG_MAPCTRL2_STATADDR_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL2_NACK_POS               12 /**< TARG_MAPCTRL2_NACK Position */
#define MXC_F_I3C_TARG_MAPCTRL2_NACK                   ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL2_NACK_POS)) /**< TARG_MAPCTRL2_NACK Mask */

#define MXC_F_I3C_TARG_MAPCTRL2_AUTO_EN_POS            13 /**< TARG_MAPCTRL2_AUTO_EN Position */
#define MXC_F_I3C_TARG_MAPCTRL2_AUTO_EN                ((uint32_t)(0x1UL << MXC_F_I3C_TARG_MAPCTRL2_AUTO_EN_POS)) /**< TARG_MAPCTRL2_AUTO_EN Mask */

#define MXC_F_I3C_TARG_MAPCTRL2_PID_POS                14 /**< TARG_MAPCTRL2_PID Position */
#define MXC_F_I3C_TARG_MAPCTRL2_PID                    ((uint32_t)(0x3FFFFUL << MXC_F_I3C_TARG_MAPCTRL2_PID_POS)) /**< TARG_MAPCTRL2_PID Mask */

/**@} end of group I3C_TARG_MAPCTRL2_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_I3C_REGS_H_
